using System;
using Microsoft.EntityFrameworkCore.Migrations;

namespace ProductCatalog.Data.Migrations
{
    public partial class Initial_Migration : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.CreateTable(
                name: "AspNetRoles",
                columns: table => new
                {
                    Id = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    Name = table.Column<string>(type: "nvarchar(256)", maxLength: 256, nullable: true),
                    NormalizedName = table.Column<string>(type: "nvarchar(256)", maxLength: 256, nullable: true),
                    ConcurrencyStamp = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetRoles", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "AspNetUsers",
                columns: table => new
                {
                    Id = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    UserName = table.Column<string>(type: "nvarchar(256)", maxLength: 256, nullable: true),
                    NormalizedUserName = table.Column<string>(type: "nvarchar(256)", maxLength: 256, nullable: true),
                    Email = table.Column<string>(type: "nvarchar(256)", maxLength: 256, nullable: true),
                    NormalizedEmail = table.Column<string>(type: "nvarchar(256)", maxLength: 256, nullable: true),
                    EmailConfirmed = table.Column<bool>(type: "bit", nullable: false),
                    PasswordHash = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    SecurityStamp = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    ConcurrencyStamp = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    PhoneNumber = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    PhoneNumberConfirmed = table.Column<bool>(type: "bit", nullable: false),
                    TwoFactorEnabled = table.Column<bool>(type: "bit", nullable: false),
                    LockoutEnd = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: true),
                    LockoutEnabled = table.Column<bool>(type: "bit", nullable: false),
                    AccessFailedCount = table.Column<int>(type: "int", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetUsers", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "Categories",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    Name = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Categories", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "AspNetRoleClaims",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    RoleId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    ClaimType = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    ClaimValue = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetRoleClaims", x => x.Id);
                    table.ForeignKey(
                        name: "FK_AspNetRoleClaims_AspNetRoles_RoleId",
                        column: x => x.RoleId,
                        principalTable: "AspNetRoles",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "AspNetUserClaims",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    ClaimType = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    ClaimValue = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetUserClaims", x => x.Id);
                    table.ForeignKey(
                        name: "FK_AspNetUserClaims_AspNetUsers_UserId",
                        column: x => x.UserId,
                        principalTable: "AspNetUsers",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "AspNetUserLogins",
                columns: table => new
                {
                    LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    ProviderKey = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    ProviderDisplayName = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetUserLogins", x => new { x.LoginProvider, x.ProviderKey });
                    table.ForeignKey(
                        name: "FK_AspNetUserLogins_AspNetUsers_UserId",
                        column: x => x.UserId,
                        principalTable: "AspNetUsers",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "AspNetUserRoles",
                columns: table => new
                {
                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    RoleId = table.Column<string>(type: "nvarchar(450)", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetUserRoles", x => new { x.UserId, x.RoleId });
                    table.ForeignKey(
                        name: "FK_AspNetUserRoles_AspNetRoles_RoleId",
                        column: x => x.RoleId,
                        principalTable: "AspNetRoles",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                    table.ForeignKey(
                        name: "FK_AspNetUserRoles_AspNetUsers_UserId",
                        column: x => x.UserId,
                        principalTable: "AspNetUsers",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "AspNetUserTokens",
                columns: table => new
                {
                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    Name = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    Value = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetUserTokens", x => new { x.UserId, x.LoginProvider, x.Name });
                    table.ForeignKey(
                        name: "FK_AspNetUserTokens_AspNetUsers_UserId",
                        column: x => x.UserId,
                        principalTable: "AspNetUsers",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "Products",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    Name = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    Description = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    Cost = table.Column<double>(type: "float", nullable: false),
                    GeneralNote = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    SpecialNote = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    CategoryId = table.Column<int>(type: "int", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Products", x => x.Id);
                    table.ForeignKey(
                        name: "FK_Products_Categories_CategoryId",
                        column: x => x.CategoryId,
                        principalTable: "Categories",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.InsertData(
                table: "Categories",
                columns: new[] { "Id", "Name" },
                values: new object[,]
                {
                    { 1, "Еда" },
                    { 18, "Паста" },
                    { 17, "Десерты" },
                    { 16, "Салаты" },
                    { 15, "Пицца" },
                    { 14, "Закуски" },
                    { 13, "Напитки" },
                    { 12, "Супы" },
                    { 11, "Гарниры" },
                    { 10, "Сладости" },
                    { 9, "Зерновые" },
                    { 8, "Молочные продукты" },
                    { 7, "Рыба" },
                    { 6, "Мясо" },
                    { 5, "Овощи" },
                    { 4, "Фрукты" },
                    { 3, "Вода" },
                    { 2, "Вкусности" },
                    { 19, "Рис" },
                    { 20, "Соусы" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 64, 1, 1.0, "Сочное", "Натуральное", "Соус", "Сырое" },
                    { 302, 13, 181.0, "Твердое", "Красивое", "Хлеб", "Сладкое" },
                    { 325, 13, 68.0, "Сытное", "Фруктовое", "Орехи", "Запеченное" },
                    { 341, 13, 21.0, "Молочное", "Молочное", "Мед", "Медовое" },
                    { 355, 13, 168.0, "Пикантное", "Мягкое", "Томаты", "Полезное" },
                    { 396, 13, 203.0, "Сырое", "Шоколадное", "Салат", "Питательное" },
                    { 402, 13, 161.0, "Вкусное", "Тушеное", "Сок", "Сытное" },
                    { 403, 13, 238.0, "Молочное", "Молочное", "Томаты", "Приправленное" },
                    { 412, 13, 173.0, "Морское", "Ванильное", "Кола", "Ржаное" },
                    { 428, 13, 159.0, "Ароматное", "Сочное", "Паста", "Мягкое" },
                    { 433, 13, 156.0, "Сочное", "Ванильное", "Майонез", "Питательное" },
                    { 436, 13, 37.0, "Свежевыжатое", "Мягкое", "Кофе", "Натуральное" },
                    { 438, 13, 200.0, "Сладкое", "Рыбное", "Торт", "Твердое" },
                    { 482, 13, 78.0, "Сырое", "Запеченное", "Кофе", "Тушеное" },
                    { 489, 13, 164.0, "Натуральное", "Сытное", "Красное вино", "Овощное" },
                    { 493, 13, 219.0, "Ароматное", "Натуральное", "Рыба", "Вкусное" },
                    { 501, 13, 195.0, "Сладкое", "Соленое", "Маргарин", "Свежевыжатое" },
                    { 507, 13, 3.0, "Сочное", "Мясное", "Кола", "Полезное" },
                    { 511, 13, 181.0, "Шоколадное", "Тушеное", "Рис", "Молочное" },
                    { 534, 13, 111.0, "Свежевыжатое", "Твердое", "Красное вино", "Фруктовое" },
                    { 536, 13, 107.0, "Твердое", "Сладкое", "Торт", "Сырое" },
                    { 552, 13, 90.0, "Питательное", "Приправленное", "Каша", "Полезное" },
                    { 560, 13, 218.0, "Острое", "Натуральное", "Тушенка", "Пряное" },
                    { 563, 13, 3.0, "Жареное", "Вкусное", "Курица", "Рыбное" },
                    { 610, 13, 238.0, "Мясное", "Шоколадное", "Курица", "Вареное" },
                    { 642, 13, 163.0, "Острое", "Шоколадное", "Морковь", "Красивое" },
                    { 676, 13, 30.0, "Фруктовое", "Пряное", "Сгущенка", "Запеченное" },
                    { 690, 13, 114.0, "Сочное", "Сладкое", "Шоколад", "Сладкое" },
                    { 301, 13, 95.0, "Сладкое", "Соленое", "Мясо", "Рыбное" },
                    { 694, 13, 150.0, "Сытное", "Тушеное", "Пирог", "Красивое" },
                    { 290, 13, 156.0, "Питательное", "Свежевыжатое", "Майонез", "Фруктовое" },
                    { 271, 13, 144.0, "Жареное", "Тушеное", "Соус", "Фруктовое" },
                    { 660, 12, 68.0, "Соленое", "Натуральное", "Тушенка", "Шоколадное" },
                    { 664, 12, 171.0, "Морское", "Вареное", "Курица", "Мягкое" },
                    { 723, 12, 81.0, "Красивое", "Сладкое", "Маргарин", "Шоколадное" },
                    { 729, 12, 161.0, "Натуральное", "Овощное", "Кекс", "Молочное" },
                    { 746, 12, 14.0, "Сытное", "Ржаное", "Печенье", "Вкусное" },
                    { 750, 12, 102.0, "Вкусное", "Пряное", "Каша", "Свежевыжатое" },
                    { 771, 12, 227.0, "Ржаное", "Сырое", "Перец", "Мясное" },
                    { 804, 12, 35.0, "Питательное", "Вареное", "Чай", "Мягкое" },
                    { 811, 12, 100.0, "Приправленное", "Фруктовое", "Сок", "Сырое" },
                    { 823, 12, 149.0, "Сладкое", "Полезное", "Сыр", "Свежевыжатое" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 839, 12, 66.0, "Свежее", "Свежевыжатое", "Сыр", "Жидкое" },
                    { 847, 12, 30.0, "Питательное", "Ароматное", "Кофе", "Ароматное" },
                    { 855, 12, 68.0, "Жидкое", "Постное", "Кекс", "Сладкое" },
                    { 901, 12, 205.0, "Твердое", "Сырое", "Маргарин", "Соленое" },
                    { 949, 12, 246.0, "Приправленное", "Медовое", "Картофель", "Сладкое" },
                    { 974, 12, 71.0, "Соленое", "Овощное", "Маргарин", "Полезное" },
                    { 33, 13, 117.0, "Ржаное", "Жареное", "Вода", "Молочное" },
                    { 72, 13, 238.0, "Молочное", "Пшеничное", "Морепродукты", "Ржаное" },
                    { 89, 13, 236.0, "Шоколадное", "Вкусное", "Квас", "Свежее" },
                    { 101, 13, 133.0, "Мясное", "Молочное", "Кекс", "Овощное" },
                    { 130, 13, 18.0, "Соленое", "Молочное", "Рис", "Ванильное" },
                    { 135, 13, 19.0, "Фруктовое", "Ванильное", "Соус", "Ванильное" },
                    { 138, 13, 235.0, "Вареное", "Ванильное", "Перец", "Сладкое" },
                    { 153, 13, 157.0, "Фруктовое", "Острое", "Рыба", "Овощное" },
                    { 182, 13, 235.0, "Овощное", "Фруктовое", "Рыба", "Пряное" },
                    { 206, 13, 162.0, "Полезное", "Постное", "Сахар", "Свежее" },
                    { 232, 13, 198.0, "Вкусное", "Шоколадное", "Торт", "Красивое" },
                    { 282, 13, 152.0, "Жидкое", "Фруктовое", "Печенье", "Сытное" },
                    { 700, 13, 43.0, "Твердое", "Постное", "Соус", "Питательное" },
                    { 713, 13, 176.0, "Свежевыжатое", "Ванильное", "Морепродукты", "Тушеное" },
                    { 714, 13, 213.0, "Сочное", "Сырое", "Соль", "Ароматное" },
                    { 315, 14, 166.0, "Пшеничное", "Сочное", "Кофе", "Шоколадное" },
                    { 318, 14, 23.0, "Свежевыжатое", "Тушеное", "Перец", "Фруктовое" },
                    { 356, 14, 114.0, "Вкусное", "Приправленное", "Мед", "Ароматное" },
                    { 370, 14, 83.0, "Твердое", "Вареное", "Яйца", "Натуральное" },
                    { 384, 14, 116.0, "Полезное", "Полезное", "Рис", "Овощное" },
                    { 404, 14, 103.0, "Красивое", "Медовое", "Сыр", "Сытное" },
                    { 405, 14, 77.0, "Соленое", "Сладкое", "Огурцы", "Полезное" },
                    { 409, 14, 115.0, "Ванильное", "Ароматное", "Кекс", "Сладкое" },
                    { 459, 14, 145.0, "Свежевыжатое", "Молочное", "Рис", "Молочное" },
                    { 469, 14, 230.0, "Рыбное", "Сладкое", "Квас", "Тушеное" },
                    { 473, 14, 107.0, "Сытное", "Сырое", "Перец", "Мягкое" },
                    { 508, 14, 59.0, "Ржаное", "Сладкое", "Печенье", "Сырое" },
                    { 523, 14, 112.0, "Полезное", "Красивое", "Кекс", "Сытное" },
                    { 531, 14, 56.0, "Ароматное", "Свежее", "Белое вино", "Вареное" },
                    { 586, 14, 64.0, "Запеченное", "Ржаное", "Кекс", "Молочное" },
                    { 624, 14, 58.0, "Вкусное", "Жидкое", "Соль", "Приправленное" },
                    { 635, 14, 189.0, "Вареное", "Морское", "Рыба", "Твердое" },
                    { 662, 14, 52.0, "Шоколадное", "Постное", "Молоко", "Жидкое" },
                    { 672, 14, 88.0, "Рыбное", "Жидкое", "Томаты", "Молочное" },
                    { 692, 14, 11.0, "Пикантное", "Мясное", "Курица", "Сырое" },
                    { 704, 14, 147.0, "Пряное", "Фруктовое", "Салат", "Сладкое" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 719, 14, 225.0, "Приправленное", "Натуральное", "Торт", "Фруктовое" },
                    { 720, 14, 205.0, "Сытное", "Полезное", "Белое вино", "Свежее" },
                    { 735, 14, 240.0, "Тушеное", "Ржаное", "Хлеб", "Постное" },
                    { 762, 14, 138.0, "Пряное", "Постное", "Соль", "Острое" },
                    { 765, 14, 30.0, "Ржаное", "Шоколадное", "Яйца", "Ржаное" },
                    { 776, 14, 181.0, "Сладкое", "Жареное", "Красное вино", "Сладкое" },
                    { 283, 14, 69.0, "Сочное", "Жареное", "Соль", "Пикантное" },
                    { 255, 14, 213.0, "Свежевыжатое", "Свежевыжатое", "Тушенка", "Сырое" },
                    { 238, 14, 58.0, "Соленое", "Красивое", "Вода", "Молочное" },
                    { 235, 14, 78.0, "Вкусное", "Пшеничное", "Макароны", "Овощное" },
                    { 752, 13, 216.0, "Запеченное", "Сладкое", "Красное вино", "Сладкое" },
                    { 753, 13, 109.0, "Жидкое", "Рыбное", "Макароны", "Мягкое" },
                    { 774, 13, 51.0, "Ванильное", "Пряное", "Соль", "Соленое" },
                    { 819, 13, 17.0, "Сытное", "Фруктовое", "Картофель", "Молочное" },
                    { 909, 13, 122.0, "Сочное", "Рыбное", "Соль", "Свежевыжатое" },
                    { 955, 13, 33.0, "Постное", "Постное", "Хлеб", "Мягкое" },
                    { 959, 13, 217.0, "Пряное", "Рыбное", "Сок", "Ванильное" },
                    { 980, 13, 83.0, "Тушеное", "Рыбное", "Мед", "Пикантное" },
                    { 994, 13, 85.0, "Полезное", "Мясное", "Сгущенка", "Мягкое" },
                    { 999, 13, 24.0, "Морское", "Молочное", "Кола", "Постное" },
                    { 6, 14, 78.0, "Мясное", "Ржаное", "Рыба", "Медовое" },
                    { 10, 14, 23.0, "Рыбное", "Пикантное", "Тушенка", "Вареное" },
                    { 16, 14, 86.0, "Твердое", "Острое", "Рыба", "Соленое" },
                    { 658, 12, 202.0, "Жидкое", "Пикантное", "Сахар", "Морское" },
                    { 51, 14, 100.0, "Натуральное", "Ржаное", "Курица", "Питательное" },
                    { 68, 14, 143.0, "Свежевыжатое", "Шоколадное", "Яйца", "Ржаное" },
                    { 80, 14, 172.0, "Тушеное", "Рыбное", "Кофе", "Медовое" },
                    { 84, 14, 25.0, "Свежее", "Тушеное", "Рис", "Красивое" },
                    { 115, 14, 163.0, "Пикантное", "Вкусное", "Красное вино", "Приправленное" },
                    { 124, 14, 9.0, "Острое", "Пряное", "Морковь", "Рыбное" },
                    { 134, 14, 206.0, "Нежное", "Постное", "Шоколад", "Морское" },
                    { 139, 14, 81.0, "Пряное", "Приправленное", "Пицца", "Фруктовое" },
                    { 141, 14, 21.0, "Приправленное", "Тушеное", "Маргарин", "Вареное" },
                    { 164, 14, 164.0, "Приправленное", "Пикантное", "Огурцы", "Молочное" },
                    { 179, 14, 112.0, "Твердое", "Вареное", "Макароны", "Полезное" },
                    { 218, 14, 58.0, "Нежное", "Пикантное", "Овощи", "Вкусное" },
                    { 225, 14, 121.0, "Приправленное", "Красивое", "Гречка", "Запеченное" },
                    { 228, 14, 77.0, "Запеченное", "Пикантное", "Сок", "Мясное" },
                    { 62, 14, 218.0, "Ароматное", "Ржаное", "Пельмени", "Натуральное" },
                    { 801, 14, 225.0, "Сладкое", "Сырое", "Пицца", "Твердое" },
                    { 644, 12, 79.0, "Шоколадное", "Пшеничное", "Орехи", "Полезное" },
                    { 632, 12, 94.0, "Соленое", "Тушеное", "Квас", "Постное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 29, 11, 150.0, "Нежное", "Натуральное", "Салат", "Полезное" },
                    { 93, 11, 24.0, "Сырое", "Сочное", "Морковь", "Свежевыжатое" },
                    { 95, 11, 233.0, "Ржаное", "Мясное", "Сыр", "Пряное" },
                    { 126, 11, 232.0, "Мягкое", "Красивое", "Квас", "Мясное" },
                    { 150, 11, 101.0, "Сладкое", "Сладкое", "Тушенка", "Мясное" },
                    { 156, 11, 154.0, "Ароматное", "Молочное", "Хлеб", "Вкусное" },
                    { 157, 11, 94.0, "Твердое", "Ржаное", "Рыба", "Нежное" },
                    { 202, 11, 86.0, "Питательное", "Ржаное", "Гречка", "Сырое" },
                    { 214, 11, 214.0, "Твердое", "Нежное", "Овощи", "Запеченное" },
                    { 227, 11, 207.0, "Морское", "Вкусное", "Макароны", "Мягкое" },
                    { 248, 11, 194.0, "Ароматное", "Натуральное", "Курица", "Ароматное" },
                    { 257, 11, 9.0, "Жареное", "Рыбное", "Майонез", "Мягкое" },
                    { 275, 11, 75.0, "Ржаное", "Соленое", "Паста", "Шоколадное" },
                    { 279, 11, 10.0, "Питательное", "Свежевыжатое", "Фрукты", "Молочное" },
                    { 293, 11, 249.0, "Ванильное", "Полезное", "Рыба", "Сырое" },
                    { 339, 11, 92.0, "Жидкое", "Мягкое", "Маргарин", "Сырое" },
                    { 342, 11, 150.0, "Натуральное", "Сытное", "Кетчуп", "Овощное" },
                    { 364, 11, 124.0, "Питательное", "Сочное", "Салат", "Морское" },
                    { 379, 11, 78.0, "Вкусное", "Вареное", "Каша", "Нежное" },
                    { 426, 11, 85.0, "Полезное", "Шоколадное", "Гречка", "Свежевыжатое" },
                    { 466, 11, 188.0, "Натуральное", "Рыбное", "Гречка", "Пшеничное" },
                    { 492, 11, 38.0, "Сладкое", "Свежевыжатое", "Красное вино", "Вкусное" },
                    { 498, 11, 39.0, "Пшеничное", "Сытное", "Мороженное", "Нежное" },
                    { 521, 11, 79.0, "Рыбное", "Сладкое", "Сок", "Сырое" },
                    { 526, 11, 36.0, "Вкусное", "Мягкое", "Белое вино", "Медовое" },
                    { 530, 11, 245.0, "Соленое", "Сырое", "Кетчуп", "Сырое" },
                    { 537, 11, 84.0, "Сладкое", "Питательное", "Рыба", "Питательное" },
                    { 28, 11, 204.0, "Ванильное", "Натуральное", "Гречка", "Пряное" },
                    { 576, 11, 216.0, "Пшеничное", "Постное", "Квас", "Приправленное" },
                    { 18, 11, 224.0, "Ароматное", "Нежное", "Кофе", "Пикантное" },
                    { 992, 10, 199.0, "Рыбное", "Морское", "Томаты", "Овощное" },
                    { 554, 10, 212.0, "Сочное", "Шоколадное", "Фрукты", "Овощное" },
                    { 572, 10, 108.0, "Запеченное", "Фруктовое", "Квас", "Сочное" },
                    { 583, 10, 111.0, "Нежное", "Свежее", "Огурцы", "Пряное" },
                    { 617, 10, 120.0, "Свежее", "Питательное", "Сыр", "Свежее" },
                    { 643, 10, 242.0, "Соленое", "Сочное", "Курица", "Твердое" },
                    { 646, 10, 15.0, "Фруктовое", "Мясное", "Мороженное", "Свежее" },
                    { 649, 10, 14.0, "Сладкое", "Фруктовое", "Рыба", "Фруктовое" },
                    { 650, 10, 99.0, "Тушеное", "Мягкое", "Орехи", "Твердое" },
                    { 671, 10, 146.0, "Тушеное", "Соленое", "Торт", "Шоколадное" },
                    { 691, 10, 121.0, "Сладкое", "Твердое", "Чай", "Сладкое" },
                    { 699, 10, 101.0, "Свежевыжатое", "Свежее", "Салат", "Мясное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 718, 10, 176.0, "Соленое", "Нежное", "Кекс", "Жареное" },
                    { 737, 10, 52.0, "Вареное", "Натуральное", "Яйца", "Полезное" },
                    { 754, 10, 145.0, "Натуральное", "Сочное", "Маргарин", "Жареное" },
                    { 775, 10, 81.0, "Овощное", "Сладкое", "Перец", "Пряное" },
                    { 784, 10, 224.0, "Ржаное", "Ароматное", "Тушенка", "Мягкое" },
                    { 796, 10, 135.0, "Тушеное", "Пшеничное", "Кекс", "Ванильное" },
                    { 813, 10, 210.0, "Мясное", "Сытное", "Кола", "Сырое" },
                    { 818, 10, 108.0, "Морское", "Сочное", "Хлеб", "Ржаное" },
                    { 844, 10, 87.0, "Ржаное", "Вареное", "Молоко", "Пряное" },
                    { 930, 10, 249.0, "Запеченное", "Сырое", "Кекс", "Запеченное" },
                    { 933, 10, 213.0, "Шоколадное", "Пикантное", "Пицца", "Питательное" },
                    { 938, 10, 57.0, "Питательное", "Вареное", "Квас", "Молочное" },
                    { 946, 10, 150.0, "Постное", "Молочное", "Мясо", "Вкусное" },
                    { 953, 10, 67.0, "Сытное", "Острое", "Пирог", "Свежее" },
                    { 969, 10, 120.0, "Мягкое", "Свежевыжатое", "Пицца", "Свежевыжатое" },
                    { 985, 10, 225.0, "Ванильное", "Ванильное", "Рис", "Сытное" },
                    { 996, 10, 61.0, "Вареное", "Пикантное", "Морепродукты", "Запеченное" },
                    { 620, 11, 28.0, "Тушеное", "Овощное", "Белое вино", "Пикантное" },
                    { 631, 11, 127.0, "Постное", "Сладкое", "Макароны", "Ванильное" },
                    { 639, 11, 60.0, "Питательное", "Сочное", "Паста", "Свежее" },
                    { 169, 12, 33.0, "Ароматное", "Ароматное", "Морепродукты", "Фруктовое" },
                    { 178, 12, 17.0, "Сладкое", "Шоколадное", "Каша", "Сладкое" },
                    { 181, 12, 1.0, "Тушеное", "Сладкое", "Каша", "Сытное" },
                    { 183, 12, 45.0, "Фруктовое", "Тушеное", "Салат", "Нежное" },
                    { 194, 12, 165.0, "Ванильное", "Рыбное", "Фрукты", "Мясное" },
                    { 201, 12, 162.0, "Мясное", "Полезное", "Сгущенка", "Красивое" },
                    { 224, 12, 163.0, "Сырое", "Сырое", "Мясо", "Сладкое" },
                    { 229, 12, 48.0, "Ароматное", "Сладкое", "Белое вино", "Жареное" },
                    { 231, 12, 76.0, "Ванильное", "Полезное", "Мороженное", "Овощное" },
                    { 246, 12, 91.0, "Рыбное", "Запеченное", "Чай", "Соленое" },
                    { 286, 12, 77.0, "Пикантное", "Приправленное", "Майонез", "Красивое" },
                    { 320, 12, 145.0, "Пряное", "Молочное", "Курица", "Полезное" },
                    { 330, 12, 108.0, "Рыбное", "Натуральное", "Сыр", "Запеченное" },
                    { 332, 12, 10.0, "Сладкое", "Полезное", "Печенье", "Ванильное" },
                    { 335, 12, 165.0, "Натуральное", "Соленое", "Красное вино", "Сладкое" },
                    { 366, 12, 75.0, "Свежее", "Нежное", "Макароны", "Полезное" },
                    { 391, 12, 62.0, "Мягкое", "Сладкое", "Кофе", "Шоколадное" },
                    { 432, 12, 39.0, "Ржаное", "Сытное", "Каша", "Ванильное" },
                    { 445, 12, 108.0, "Ржаное", "Жареное", "Салат", "Овощное" },
                    { 446, 12, 167.0, "Нежное", "Острое", "Салат", "Красивое" },
                    { 467, 12, 48.0, "Молочное", "Фруктовое", "Морепродукты", "Медовое" },
                    { 579, 12, 181.0, "Пшеничное", "Медовое", "Перец", "Овощное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 585, 12, 174.0, "Ванильное", "Морское", "Мясо", "Жареное" },
                    { 590, 12, 98.0, "Ржаное", "Натуральное", "Сгущенка", "Запеченное" },
                    { 603, 12, 234.0, "Сочное", "Сырое", "Кофе", "Молочное" },
                    { 608, 12, 162.0, "Молочное", "Твердое", "Морепродукты", "Сочное" },
                    { 618, 12, 237.0, "Свежее", "Ванильное", "Фрукты", "Пикантное" },
                    { 163, 12, 176.0, "Питательное", "Запеченное", "Пельмени", "Ванильное" },
                    { 140, 12, 57.0, "Сладкое", "Натуральное", "Орехи", "Красивое" },
                    { 119, 12, 110.0, "Сытное", "Запеченное", "Яйца", "Жареное" },
                    { 117, 12, 43.0, "Приправленное", "Ароматное", "Перец", "Сырое" },
                    { 669, 11, 93.0, "Пикантное", "Ванильное", "Мясо", "Сырое" },
                    { 712, 11, 168.0, "Нежное", "Шоколадное", "Морковь", "Медовое" },
                    { 727, 11, 62.0, "Соленое", "Жареное", "Белое вино", "Сочное" },
                    { 728, 11, 141.0, "Запеченное", "Тушеное", "Молоко", "Сочное" },
                    { 731, 11, 180.0, "Вкусное", "Острое", "Томаты", "Шоколадное" },
                    { 749, 11, 163.0, "Мягкое", "Тушеное", "Вода", "Овощное" },
                    { 808, 11, 154.0, "Мясное", "Молочное", "Сгущенка", "Морское" },
                    { 809, 11, 33.0, "Жареное", "Мясное", "Яйца", "Шоколадное" },
                    { 822, 11, 110.0, "Сочное", "Шоколадное", "Орехи", "Натуральное" },
                    { 825, 11, 147.0, "Сладкое", "Натуральное", "Сок", "Сочное" },
                    { 829, 11, 65.0, "Приправленное", "Свежевыжатое", "Паста", "Ванильное" },
                    { 842, 11, 167.0, "Сытное", "Сладкое", "Квас", "Ржаное" },
                    { 870, 11, 151.0, "Шоколадное", "Приправленное", "Пирог", "Тушеное" },
                    { 637, 12, 177.0, "Мясное", "Сырое", "Маргарин", "Свежевыжатое" },
                    { 886, 11, 249.0, "Сладкое", "Пряное", "Пельмени", "Запеченное" },
                    { 891, 11, 136.0, "Вкусное", "Медовое", "Огурцы", "Твердое" },
                    { 892, 11, 231.0, "Соленое", "Овощное", "Вода", "Шоколадное" },
                    { 898, 11, 139.0, "Ржаное", "Сырое", "Морепродукты", "Сырое" },
                    { 913, 11, 219.0, "Ржаное", "Твердое", "Гречка", "Фруктовое" },
                    { 948, 11, 173.0, "Вкусное", "Соленое", "Томаты", "Тушеное" },
                    { 973, 11, 233.0, "Жареное", "Соленое", "Вода", "Ржаное" },
                    { 988, 11, 216.0, "Постное", "Сытное", "Орехи", "Постное" },
                    { 15, 12, 127.0, "Пшеничное", "Запеченное", "Макароны", "Полезное" },
                    { 36, 12, 124.0, "Натуральное", "Твердое", "Молоко", "Приправленное" },
                    { 69, 12, 35.0, "Сырое", "Свежее", "Кола", "Сочное" },
                    { 83, 12, 169.0, "Приправленное", "Полезное", "Сок", "Морское" },
                    { 88, 12, 207.0, "Медовое", "Сладкое", "Хлеб", "Жареное" },
                    { 105, 12, 180.0, "Нежное", "Пикантное", "Квас", "Сырое" },
                    { 889, 11, 94.0, "Вареное", "Приправленное", "Соус", "Вареное" },
                    { 549, 10, 133.0, "Медовое", "Твердое", "Яйца", "Нежное" },
                    { 806, 14, 95.0, "Постное", "Вкусное", "Салат", "Пряное" },
                    { 835, 14, 136.0, "Красивое", "Тушеное", "Морковь", "Морское" },
                    { 502, 17, 223.0, "Шоколадное", "Жидкое", "Мясо", "Соленое" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 514, 17, 118.0, "Медовое", "Тушеное", "Гречка", "Пшеничное" },
                    { 535, 17, 133.0, "Острое", "Овощное", "Пирог", "Мясное" },
                    { 566, 17, 29.0, "Свежее", "Вареное", "Фрукты", "Постное" },
                    { 594, 17, 9.0, "Сочное", "Ванильное", "Сгущенка", "Пикантное" },
                    { 597, 17, 79.0, "Медовое", "Натуральное", "Рыба", "Сытное" },
                    { 613, 17, 234.0, "Приправленное", "Свежевыжатое", "Мед", "Пряное" },
                    { 622, 17, 155.0, "Запеченное", "Молочное", "Картофель", "Сладкое" },
                    { 633, 17, 80.0, "Сытное", "Медовое", "Овощи", "Рыбное" },
                    { 652, 17, 172.0, "Ароматное", "Полезное", "Мороженное", "Овощное" },
                    { 685, 17, 185.0, "Жидкое", "Рыбное", "Чай", "Твердое" },
                    { 722, 17, 160.0, "Ароматное", "Пикантное", "Рыба", "Свежее" },
                    { 733, 17, 166.0, "Острое", "Пряное", "Соус", "Сочное" },
                    { 742, 17, 195.0, "Нежное", "Запеченное", "Рыба", "Тушеное" },
                    { 786, 17, 12.0, "Соленое", "Сочное", "Белое вино", "Ржаное" },
                    { 793, 17, 243.0, "Сырое", "Овощное", "Майонез", "Морское" },
                    { 807, 17, 59.0, "Пикантное", "Острое", "Пельмени", "Молочное" },
                    { 826, 17, 115.0, "Свежее", "Острое", "Торт", "Свежее" },
                    { 837, 17, 154.0, "Сочное", "Ржаное", "Торт", "Натуральное" },
                    { 840, 17, 75.0, "Острое", "Морское", "Торт", "Нежное" },
                    { 841, 17, 53.0, "Жареное", "Тушеное", "Салат", "Свежевыжатое" },
                    { 846, 17, 94.0, "Ванильное", "Жидкое", "Хлеб", "Шоколадное" },
                    { 852, 17, 217.0, "Питательное", "Пшеничное", "Печенье", "Мягкое" },
                    { 861, 17, 74.0, "Запеченное", "Мягкое", "Сахар", "Запеченное" },
                    { 862, 17, 34.0, "Сочное", "Тушеное", "Маргарин", "Сочное" },
                    { 866, 17, 64.0, "Рыбное", "Пряное", "Морковь", "Соленое" },
                    { 873, 17, 39.0, "Мясное", "Полезное", "Картофель", "Молочное" },
                    { 494, 17, 177.0, "Пшеничное", "Морское", "Вода", "Вкусное" },
                    { 910, 17, 247.0, "Свежее", "Мясное", "Тушенка", "Тушеное" },
                    { 490, 17, 205.0, "Овощное", "Свежее", "Чай", "Медовое" },
                    { 424, 17, 189.0, "Острое", "Ванильное", "Кола", "Питательное" },
                    { 887, 16, 7.0, "Полезное", "Соленое", "Пицца", "Сытное" },
                    { 919, 16, 128.0, "Ванильное", "Питательное", "Мед", "Свежее" },
                    { 922, 16, 193.0, "Свежее", "Питательное", "Торт", "Сырое" },
                    { 923, 16, 111.0, "Вареное", "Сырое", "Кекс", "Жидкое" },
                    { 971, 16, 21.0, "Пряное", "Сытное", "Соус", "Молочное" },
                    { 989, 16, 99.0, "Сладкое", "Сочное", "Макароны", "Овощное" },
                    { 14, 17, 5.0, "Фруктовое", "Запеченное", "Орехи", "Нежное" },
                    { 23, 17, 38.0, "Запеченное", "Твердое", "Красное вино", "Рыбное" },
                    { 34, 17, 14.0, "Медовое", "Нежное", "Фрукты", "Сладкое" },
                    { 44, 17, 216.0, "Пшеничное", "Фруктовое", "Соль", "Свежее" },
                    { 92, 17, 65.0, "Шоколадное", "Полезное", "Рис", "Свежевыжатое" },
                    { 104, 17, 99.0, "Питательное", "Свежее", "Сыр", "Ванильное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 112, 17, 151.0, "Твердое", "Запеченное", "Майонез", "Овощное" },
                    { 123, 17, 16.0, "Постное", "Тушеное", "Овощи", "Полезное" },
                    { 190, 17, 97.0, "Твердое", "Сочное", "Паста", "Рыбное" },
                    { 199, 17, 58.0, "Сладкое", "Сладкое", "Кола", "Сочное" },
                    { 220, 17, 115.0, "Молочное", "Сладкое", "Рыба", "Медовое" },
                    { 230, 17, 12.0, "Шоколадное", "Ароматное", "Мороженное", "Вареное" },
                    { 233, 17, 148.0, "Ржаное", "Сладкое", "Морепродукты", "Соленое" },
                    { 247, 17, 125.0, "Шоколадное", "Соленое", "Красное вино", "Нежное" },
                    { 250, 17, 220.0, "Мясное", "Красивое", "Сок", "Красивое" },
                    { 258, 17, 92.0, "Вкусное", "Морское", "Кофе", "Пшеничное" },
                    { 274, 17, 39.0, "Пшеничное", "Фруктовое", "Перец", "Твердое" },
                    { 278, 17, 57.0, "Приправленное", "Нежное", "Макароны", "Молочное" },
                    { 288, 17, 167.0, "Шоколадное", "Медовое", "Яйца", "Нежное" },
                    { 292, 17, 175.0, "Фруктовое", "Жидкое", "Пицца", "Натуральное" },
                    { 322, 17, 29.0, "Острое", "Сочное", "Маргарин", "Нежное" },
                    { 456, 17, 244.0, "Приправленное", "Натуральное", "Кола", "Сырое" },
                    { 917, 17, 74.0, "Натуральное", "Жидкое", "Торт", "Медовое" },
                    { 926, 17, 247.0, "Шоколадное", "Жареное", "Гречка", "Морское" },
                    { 940, 17, 39.0, "Жидкое", "Сочное", "Сок", "Приправленное" },
                    { 548, 18, 246.0, "Шоколадное", "Сытное", "Курица", "Мягкое" },
                    { 571, 18, 50.0, "Питательное", "Жареное", "Фрукты", "Сладкое" },
                    { 600, 18, 192.0, "Вкусное", "Ванильное", "Чай", "Ржаное" },
                    { 607, 18, 130.0, "Ароматное", "Сырое", "Сок", "Ароматное" },
                    { 674, 18, 36.0, "Свежевыжатое", "Ароматное", "Мед", "Фруктовое" },
                    { 684, 18, 38.0, "Морское", "Свежее", "Сгущенка", "Питательное" },
                    { 696, 18, 3.0, "Вареное", "Питательное", "Кола", "Мясное" },
                    { 715, 18, 134.0, "Ржаное", "Приправленное", "Соль", "Ржаное" },
                    { 726, 18, 182.0, "Ароматное", "Свежевыжатое", "Пицца", "Сладкое" },
                    { 740, 18, 73.0, "Морское", "Ржаное", "Молоко", "Ржаное" },
                    { 748, 18, 190.0, "Сладкое", "Ароматное", "Огурцы", "Приправленное" },
                    { 755, 18, 60.0, "Питательное", "Пикантное", "Кола", "Твердое" },
                    { 757, 18, 222.0, "Морское", "Сладкое", "Мясо", "Острое" },
                    { 815, 18, 56.0, "Полезное", "Соленое", "Каша", "Ванильное" },
                    { 817, 18, 143.0, "Соленое", "Соленое", "Орехи", "Мягкое" },
                    { 845, 18, 48.0, "Сладкое", "Соленое", "Кекс", "Питательное" },
                    { 858, 18, 48.0, "Пряное", "Мягкое", "Квас", "Красивое" },
                    { 868, 18, 13.0, "Ванильное", "Свежее", "Молоко", "Молочное" },
                    { 869, 18, 174.0, "Вкусное", "Соленое", "Молоко", "Острое" },
                    { 874, 18, 209.0, "Рыбное", "Рыбное", "Курица", "Сытное" },
                    { 879, 18, 160.0, "Острое", "Нежное", "Каша", "Ржаное" },
                    { 896, 18, 76.0, "Красивое", "Фруктовое", "Перец", "Натуральное" },
                    { 902, 18, 144.0, "Сочное", "Шоколадное", "Тушенка", "Шоколадное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 924, 18, 148.0, "Питательное", "Пшеничное", "Вода", "Тушеное" },
                    { 925, 18, 125.0, "Пшеничное", "Питательное", "Тушенка", "Постное" },
                    { 947, 18, 65.0, "Медовое", "Постное", "Майонез", "Шоколадное" },
                    { 950, 18, 61.0, "Сытное", "Свежее", "Майонез", "Пряное" },
                    { 540, 18, 231.0, "Сладкое", "Рыбное", "Кекс", "Нежное" },
                    { 539, 18, 76.0, "Соленое", "Сладкое", "Тушенка", "Нежное" },
                    { 515, 18, 42.0, "Молочное", "Пикантное", "Вода", "Сладкое" },
                    { 500, 18, 162.0, "Свежевыжатое", "Пикантное", "Молоко", "Сладкое" },
                    { 977, 17, 125.0, "Сырое", "Жидкое", "Мед", "Приправленное" },
                    { 12, 18, 9.0, "Пикантное", "Вкусное", "Маргарин", "Мягкое" },
                    { 13, 18, 113.0, "Острое", "Пикантное", "Чай", "Сладкое" },
                    { 27, 18, 147.0, "Сырое", "Морское", "Яйца", "Питательное" },
                    { 57, 18, 69.0, "Вкусное", "Пшеничное", "Огурцы", "Красивое" },
                    { 67, 18, 2.0, "Овощное", "Вкусное", "Овощи", "Сытное" },
                    { 111, 18, 189.0, "Сладкое", "Мягкое", "Овощи", "Фруктовое" },
                    { 133, 18, 214.0, "Тушеное", "Фруктовое", "Рис", "Овощное" },
                    { 155, 18, 51.0, "Запеченное", "Свежевыжатое", "Пицца", "Сытное" },
                    { 168, 18, 60.0, "Овощное", "Красивое", "Красное вино", "Сырое" },
                    { 193, 18, 223.0, "Ароматное", "Запеченное", "Рыба", "Нежное" },
                    { 196, 18, 165.0, "Молочное", "Молочное", "Маргарин", "Красивое" },
                    { 216, 18, 82.0, "Тушеное", "Свежевыжатое", "Чай", "Пряное" },
                    { 885, 16, 34.0, "Вкусное", "Запеченное", "Овощи", "Жареное" },
                    { 217, 18, 38.0, "Жареное", "Красивое", "Мороженное", "Жареное" },
                    { 241, 18, 249.0, "Сладкое", "Тушеное", "Пельмени", "Тушеное" },
                    { 249, 18, 166.0, "Свежее", "Соленое", "Салат", "Полезное" },
                    { 263, 18, 188.0, "Медовое", "Тушеное", "Кофе", "Тушеное" },
                    { 296, 18, 41.0, "Свежее", "Вареное", "Перец", "Овощное" },
                    { 324, 18, 53.0, "Овощное", "Нежное", "Орехи", "Приправленное" },
                    { 329, 18, 202.0, "Свежевыжатое", "Сладкое", "Шоколад", "Пикантное" },
                    { 340, 18, 238.0, "Молочное", "Фруктовое", "Молоко", "Морское" },
                    { 343, 18, 25.0, "Пряное", "Сочное", "Пицца", "Ароматное" },
                    { 352, 18, 82.0, "Пикантное", "Пикантное", "Фрукты", "Сытное" },
                    { 362, 18, 65.0, "Нежное", "Морское", "Макароны", "Овощное" },
                    { 465, 18, 155.0, "Медовое", "Сырое", "Гречка", "Пикантное" },
                    { 468, 18, 48.0, "Мясное", "Сочное", "Тушенка", "Вкусное" },
                    { 474, 18, 59.0, "Мясное", "Нежное", "Перец", "Сырое" },
                    { 239, 18, 86.0, "Твердое", "Мягкое", "Салат", "Сладкое" },
                    { 830, 14, 9.0, "Жареное", "Сытное", "Морепродукты", "Ароматное" },
                    { 859, 16, 11.0, "Питательное", "Ванильное", "Макароны", "Мягкое" },
                    { 836, 16, 57.0, "Шоколадное", "Тушеное", "Сгущенка", "Сладкое" },
                    { 372, 15, 35.0, "Свежевыжатое", "Ванильное", "Огурцы", "Свежевыжатое" },
                    { 383, 15, 180.0, "Сочное", "Мягкое", "Яйца", "Шоколадное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 415, 15, 154.0, "Мясное", "Сладкое", "Салат", "Сытное" },
                    { 418, 15, 39.0, "Постное", "Запеченное", "Макароны", "Ржаное" },
                    { 421, 15, 57.0, "Полезное", "Вкусное", "Пицца", "Рыбное" },
                    { 471, 15, 56.0, "Сочное", "Вкусное", "Фрукты", "Красивое" },
                    { 475, 15, 164.0, "Сладкое", "Сочное", "Торт", "Мягкое" },
                    { 484, 15, 232.0, "Жидкое", "Сочное", "Овощи", "Сочное" },
                    { 491, 15, 139.0, "Свежевыжатое", "Твердое", "Квас", "Острое" },
                    { 496, 15, 68.0, "Ржаное", "Острое", "Сыр", "Сладкое" },
                    { 510, 15, 166.0, "Вареное", "Вкусное", "Паста", "Постное" },
                    { 557, 15, 13.0, "Овощное", "Натуральное", "Соус", "Вареное" },
                    { 562, 15, 246.0, "Пшеничное", "Мясное", "Овощи", "Овощное" },
                    { 564, 15, 53.0, "Шоколадное", "Молочное", "Сок", "Постное" },
                    { 567, 15, 180.0, "Шоколадное", "Соленое", "Молоко", "Пикантное" },
                    { 570, 15, 32.0, "Острое", "Сытное", "Шоколад", "Сырое" },
                    { 584, 15, 170.0, "Медовое", "Питательное", "Фрукты", "Вкусное" },
                    { 587, 15, 130.0, "Свежее", "Тушеное", "Перец", "Сытное" },
                    { 595, 15, 131.0, "Ржаное", "Жидкое", "Сахар", "Пряное" },
                    { 604, 15, 113.0, "Медовое", "Мягкое", "Рыба", "Пшеничное" },
                    { 619, 15, 194.0, "Полезное", "Жареное", "Пельмени", "Овощное" },
                    { 634, 15, 67.0, "Жидкое", "Ванильное", "Хлеб", "Вкусное" },
                    { 640, 15, 2.0, "Молочное", "Ароматное", "Каша", "Пшеничное" },
                    { 657, 15, 84.0, "Пшеничное", "Натуральное", "Чай", "Ржаное" },
                    { 681, 15, 126.0, "Сочное", "Полезное", "Пельмени", "Мясное" },
                    { 682, 15, 84.0, "Овощное", "Сочное", "Пирог", "Фруктовое" },
                    { 697, 15, 31.0, "Жидкое", "Нежное", "Тушенка", "Рыбное" },
                    { 367, 15, 227.0, "Фруктовое", "Ванильное", "Перец", "Медовое" },
                    { 707, 15, 119.0, "Свежевыжатое", "Жареное", "Пельмени", "Жареное" },
                    { 353, 15, 127.0, "Сочное", "Нежное", "Фрукты", "Соленое" },
                    { 328, 15, 128.0, "Сладкое", "Фруктовое", "Морковь", "Шоколадное" },
                    { 875, 14, 108.0, "Постное", "Сладкое", "Вода", "Пряное" },
                    { 945, 14, 154.0, "Жидкое", "Пряное", "Пицца", "Сырое" },
                    { 967, 14, 59.0, "Тушеное", "Полезное", "Каша", "Соленое" },
                    { 978, 14, 189.0, "Соленое", "Тушеное", "Паста", "Вареное" },
                    { 5, 15, 66.0, "Полезное", "Фруктовое", "Вода", "Свежее" },
                    { 45, 15, 106.0, "Острое", "Питательное", "Пицца", "Ванильное" },
                    { 55, 15, 89.0, "Питательное", "Мясное", "Сок", "Натуральное" },
                    { 58, 15, 23.0, "Соленое", "Ржаное", "Рис", "Пикантное" },
                    { 87, 15, 223.0, "Запеченное", "Свежее", "Фрукты", "Запеченное" },
                    { 107, 15, 102.0, "Мягкое", "Молочное", "Пирог", "Молочное" },
                    { 136, 15, 53.0, "Свежевыжатое", "Мясное", "Кола", "Рыбное" },
                    { 162, 15, 32.0, "Приправленное", "Сладкое", "Паста", "Рыбное" },
                    { 165, 15, 124.0, "Жареное", "Сладкое", "Фрукты", "Пикантное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 185, 15, 29.0, "Сочное", "Шоколадное", "Белое вино", "Морское" },
                    { 197, 15, 80.0, "Красивое", "Приправленное", "Маргарин", "Жареное" },
                    { 210, 15, 18.0, "Нежное", "Фруктовое", "Мед", "Мягкое" },
                    { 213, 15, 176.0, "Жареное", "Натуральное", "Морковь", "Нежное" },
                    { 242, 15, 204.0, "Красивое", "Рыбное", "Сгущенка", "Овощное" },
                    { 252, 15, 86.0, "Сладкое", "Пшеничное", "Квас", "Мясное" },
                    { 253, 15, 132.0, "Запеченное", "Молочное", "Каша", "Сытное" },
                    { 262, 15, 243.0, "Шоколадное", "Сытное", "Молоко", "Приправленное" },
                    { 266, 15, 173.0, "Пикантное", "Пикантное", "Каша", "Полезное" },
                    { 269, 15, 10.0, "Жидкое", "Сырое", "Орехи", "Приправленное" },
                    { 298, 15, 85.0, "Мягкое", "Сытное", "Мороженное", "Твердое" },
                    { 300, 15, 81.0, "Мясное", "Жидкое", "Сгущенка", "Ванильное" },
                    { 312, 15, 178.0, "Ржаное", "Фруктовое", "Печенье", "Питательное" },
                    { 313, 15, 172.0, "Тушеное", "Полезное", "Томаты", "Нежное" },
                    { 344, 15, 49.0, "Пряное", "Мясное", "Яйца", "Сытное" },
                    { 725, 15, 213.0, "Ржаное", "Фруктовое", "Соус", "Приправленное" },
                    { 734, 15, 155.0, "Запеченное", "Мягкое", "Овощи", "Сладкое" },
                    { 739, 15, 53.0, "Мягкое", "Нежное", "Гречка", "Мясное" },
                    { 413, 16, 29.0, "Рыбное", "Овощное", "Сгущенка", "Морское" },
                    { 414, 16, 102.0, "Сырое", "Пшеничное", "Сахар", "Полезное" },
                    { 447, 16, 21.0, "Вкусное", "Морское", "Картофель", "Ванильное" },
                    { 450, 16, 8.0, "Пшеничное", "Фруктовое", "Пельмени", "Постное" },
                    { 479, 16, 175.0, "Твердое", "Молочное", "Майонез", "Твердое" },
                    { 504, 16, 219.0, "Пикантное", "Ржаное", "Тушенка", "Пикантное" },
                    { 512, 16, 77.0, "Приправленное", "Запеченное", "Морковь", "Рыбное" },
                    { 517, 16, 54.0, "Полезное", "Жареное", "Соус", "Молочное" },
                    { 561, 16, 238.0, "Сочное", "Мясное", "Огурцы", "Ароматное" },
                    { 575, 16, 52.0, "Натуральное", "Ванильное", "Хлеб", "Нежное" },
                    { 591, 16, 107.0, "Шоколадное", "Приправленное", "Яйца", "Мясное" },
                    { 611, 16, 96.0, "Шоколадное", "Рыбное", "Пельмени", "Ванильное" },
                    { 612, 16, 36.0, "Сочное", "Соленое", "Томаты", "Ржаное" },
                    { 623, 16, 27.0, "Пряное", "Жареное", "Кекс", "Жареное" },
                    { 628, 16, 206.0, "Красивое", "Фруктовое", "Кола", "Тушеное" },
                    { 645, 16, 90.0, "Пшеничное", "Рыбное", "Огурцы", "Медовое" },
                    { 665, 16, 64.0, "Твердое", "Овощное", "Кекс", "Шоколадное" },
                    { 687, 16, 229.0, "Овощное", "Красивое", "Соус", "Полезное" },
                    { 695, 16, 182.0, "Сырое", "Фруктовое", "Сгущенка", "Острое" },
                    { 743, 16, 228.0, "Острое", "Овощное", "Мед", "Нежное" },
                    { 751, 16, 2.0, "Рыбное", "Пряное", "Рыба", "Пряное" },
                    { 760, 16, 218.0, "Тушеное", "Вкусное", "Паста", "Ржаное" },
                    { 769, 16, 233.0, "Пшеничное", "Жидкое", "Вода", "Запеченное" },
                    { 777, 16, 228.0, "Твердое", "Запеченное", "Мясо", "Тушеное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 783, 16, 9.0, "Питательное", "Фруктовое", "Рыба", "Вкусное" },
                    { 816, 16, 39.0, "Ароматное", "Жидкое", "Картофель", "Пряное" },
                    { 828, 16, 56.0, "Морское", "Ванильное", "Сгущенка", "Сладкое" },
                    { 407, 16, 183.0, "Пикантное", "Рыбное", "Гречка", "Рыбное" },
                    { 400, 16, 13.0, "Натуральное", "Мягкое", "Мед", "Тушеное" },
                    { 392, 16, 67.0, "Запеченное", "Натуральное", "Хлеб", "Постное" },
                    { 327, 16, 149.0, "Сочное", "Ржаное", "Мороженное", "Мягкое" },
                    { 745, 15, 97.0, "Мягкое", "Морское", "Овощи", "Сырое" },
                    { 758, 15, 10.0, "Пикантное", "Свежее", "Торт", "Вкусное" },
                    { 770, 15, 214.0, "Питательное", "Тушеное", "Кекс", "Острое" },
                    { 799, 15, 89.0, "Фруктовое", "Жидкое", "Гречка", "Полезное" },
                    { 832, 15, 98.0, "Красивое", "Тушеное", "Яйца", "Острое" },
                    { 838, 15, 145.0, "Красивое", "Свежевыжатое", "Курица", "Полезное" },
                    { 928, 15, 62.0, "Вкусное", "Жареное", "Соль", "Пикантное" },
                    { 952, 15, 20.0, "Медовое", "Пикантное", "Томаты", "Натуральное" },
                    { 956, 15, 46.0, "Свежее", "Пикантное", "Паста", "Постное" },
                    { 962, 15, 178.0, "Ржаное", "Вареное", "Белое вино", "Шоколадное" },
                    { 998, 15, 194.0, "Свежевыжатое", "Приправленное", "Соус", "Овощное" },
                    { 26, 16, 223.0, "Запеченное", "Нежное", "Перец", "Сочное" },
                    { 46, 16, 201.0, "Медовое", "Пикантное", "Гречка", "Сладкое" },
                    { 849, 16, 26.0, "Тушеное", "Сладкое", "Каша", "Приправленное" },
                    { 70, 16, 93.0, "Нежное", "Соленое", "Молоко", "Молочное" },
                    { 103, 16, 196.0, "Запеченное", "Сочное", "Томаты", "Пшеничное" },
                    { 114, 16, 140.0, "Сытное", "Жидкое", "Чай", "Запеченное" },
                    { 129, 16, 107.0, "Сладкое", "Фруктовое", "Соль", "Шоколадное" },
                    { 154, 16, 171.0, "Питательное", "Натуральное", "Красное вино", "Красивое" },
                    { 172, 16, 151.0, "Сочное", "Питательное", "Майонез", "Пикантное" },
                    { 188, 16, 120.0, "Рыбное", "Сытное", "Кола", "Натуральное" },
                    { 189, 16, 140.0, "Ванильное", "Свежевыжатое", "Тушенка", "Сырое" },
                    { 209, 16, 113.0, "Ржаное", "Пикантное", "Кекс", "Жидкое" },
                    { 267, 16, 48.0, "Медовое", "Запеченное", "Вода", "Шоколадное" },
                    { 294, 16, 247.0, "Пикантное", "Морское", "Томаты", "Нежное" },
                    { 316, 16, 157.0, "Твердое", "Жидкое", "Огурцы", "Приправленное" },
                    { 317, 16, 171.0, "Запеченное", "Мясное", "Молоко", "Красивое" },
                    { 321, 16, 134.0, "Острое", "Тушеное", "Тушенка", "Сырое" },
                    { 75, 16, 230.0, "Овощное", "Пшеничное", "Орехи", "Рыбное" },
                    { 516, 10, 156.0, "Вареное", "Ванильное", "Мясо", "Жидкое" },
                    { 485, 10, 237.0, "Полезное", "Полезное", "Вода", "Сладкое" },
                    { 416, 10, 94.0, "Сытное", "Свежее", "Хлеб", "Сладкое" },
                    { 281, 4, 18.0, "Вкусное", "Вареное", "Морепродукты", "Соленое" },
                    { 295, 4, 89.0, "Питательное", "Свежее", "Картофель", "Нежное" },
                    { 304, 4, 117.0, "Твердое", "Жидкое", "Кетчуп", "Сладкое" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 346, 4, 159.0, "Сладкое", "Сладкое", "Мед", "Свежее" },
                    { 358, 4, 39.0, "Молочное", "Сырое", "Чай", "Шоколадное" },
                    { 365, 4, 164.0, "Красивое", "Пряное", "Пельмени", "Сочное" },
                    { 388, 4, 247.0, "Натуральное", "Сытное", "Кофе", "Морское" },
                    { 397, 4, 119.0, "Жареное", "Сырое", "Кофе", "Красивое" },
                    { 435, 4, 243.0, "Сладкое", "Постное", "Кекс", "Ржаное" },
                    { 437, 4, 12.0, "Медовое", "Вареное", "Томаты", "Вареное" },
                    { 441, 4, 73.0, "Пшеничное", "Ванильное", "Квас", "Жареное" },
                    { 448, 4, 193.0, "Сырое", "Постное", "Кекс", "Пшеничное" },
                    { 451, 4, 31.0, "Сладкое", "Шоколадное", "Красное вино", "Постное" },
                    { 461, 4, 246.0, "Пряное", "Рыбное", "Овощи", "Сладкое" },
                    { 481, 4, 21.0, "Пряное", "Красивое", "Гречка", "Вкусное" },
                    { 520, 4, 77.0, "Питательное", "Свежее", "Сгущенка", "Твердое" },
                    { 551, 4, 111.0, "Мягкое", "Ванильное", "Каша", "Шоколадное" },
                    { 577, 4, 114.0, "Пшеничное", "Жареное", "Курица", "Тушеное" },
                    { 593, 4, 229.0, "Медовое", "Свежевыжатое", "Кекс", "Красивое" },
                    { 627, 4, 142.0, "Ржаное", "Ванильное", "Мясо", "Свежевыжатое" },
                    { 636, 4, 104.0, "Мягкое", "Вкусное", "Овощи", "Полезное" },
                    { 659, 4, 181.0, "Свежее", "Фруктовое", "Фрукты", "Сырое" },
                    { 675, 4, 117.0, "Ванильное", "Красивое", "Сок", "Молочное" },
                    { 721, 4, 132.0, "Полезное", "Сырое", "Сахар", "Медовое" },
                    { 736, 4, 123.0, "Мягкое", "Рыбное", "Красное вино", "Овощное" },
                    { 812, 4, 144.0, "Мясное", "Приправленное", "Мороженное", "Морское" },
                    { 814, 4, 72.0, "Тушеное", "Сладкое", "Мороженное", "Сырое" },
                    { 261, 4, 71.0, "Острое", "Нежное", "Кофе", "Морское" },
                    { 820, 4, 243.0, "Фруктовое", "Ароматное", "Орехи", "Постное" },
                    { 251, 4, 112.0, "Постное", "Свежевыжатое", "Морепродукты", "Пшеничное" },
                    { 212, 4, 40.0, "Фруктовое", "Вкусное", "Вода", "Ржаное" },
                    { 705, 3, 173.0, "Ржаное", "Нежное", "Сахар", "Овощное" },
                    { 724, 3, 165.0, "Полезное", "Вареное", "Сок", "Мягкое" },
                    { 767, 3, 46.0, "Фруктовое", "Свежее", "Рыба", "Мясное" },
                    { 782, 3, 167.0, "Вкусное", "Питательное", "Томаты", "Ароматное" },
                    { 802, 3, 5.0, "Шоколадное", "Острое", "Тушенка", "Ароматное" },
                    { 864, 3, 99.0, "Шоколадное", "Мясное", "Макароны", "Приправленное" },
                    { 880, 3, 5.0, "Ароматное", "Ароматное", "Соус", "Вкусное" },
                    { 893, 3, 129.0, "Запеченное", "Ржаное", "Чай", "Пряное" },
                    { 915, 3, 110.0, "Морское", "Запеченное", "Кекс", "Ржаное" },
                    { 920, 3, 80.0, "Постное", "Постное", "Кофе", "Пикантное" },
                    { 934, 3, 74.0, "Вареное", "Питательное", "Сыр", "Постное" },
                    { 937, 3, 38.0, "Морское", "Сладкое", "Печенье", "Пшеничное" },
                    { 943, 3, 78.0, "Мягкое", "Фруктовое", "Макароны", "Свежее" },
                    { 960, 3, 244.0, "Свежевыжатое", "Приправленное", "Мед", "Пшеничное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 982, 3, 151.0, "Шоколадное", "Пшеничное", "Квас", "Пряное" },
                    { 986, 3, 236.0, "Фруктовое", "Шоколадное", "Томаты", "Питательное" },
                    { 995, 3, 27.0, "Вкусное", "Полезное", "Овощи", "Мясное" },
                    { 21, 4, 108.0, "Жидкое", "Запеченное", "Гречка", "Приправленное" },
                    { 31, 4, 219.0, "Свежевыжатое", "Жареное", "Перец", "Тушеное" },
                    { 56, 4, 166.0, "Ароматное", "Мягкое", "Паста", "Постное" },
                    { 86, 4, 54.0, "Фруктовое", "Овощное", "Рыба", "Сытное" },
                    { 110, 4, 136.0, "Красивое", "Соленое", "Шоколад", "Мясное" },
                    { 142, 4, 76.0, "Мягкое", "Молочное", "Печенье", "Запеченное" },
                    { 191, 4, 64.0, "Запеченное", "Шоколадное", "Чай", "Запеченное" },
                    { 195, 4, 121.0, "Мягкое", "Полезное", "Каша", "Сочное" },
                    { 207, 4, 10.0, "Вкусное", "Вареное", "Перец", "Морское" },
                    { 211, 4, 237.0, "Вкусное", "Сочное", "Яйца", "Нежное" },
                    { 219, 4, 117.0, "Медовое", "Мясное", "Каша", "Запеченное" },
                    { 834, 4, 145.0, "Пшеничное", "Сладкое", "Мед", "Полезное" },
                    { 851, 4, 59.0, "Сытное", "Вареное", "Салат", "Соленое" },
                    { 856, 4, 100.0, "Сладкое", "Пряное", "Макароны", "Вкусное" },
                    { 425, 5, 40.0, "Питательное", "Сладкое", "Огурцы", "Молочное" },
                    { 455, 5, 8.0, "Твердое", "Тушеное", "Морковь", "Сытное" },
                    { 460, 5, 190.0, "Свежевыжатое", "Сладкое", "Хлеб", "Постное" },
                    { 472, 5, 21.0, "Сладкое", "Жидкое", "Каша", "Сочное" },
                    { 477, 5, 63.0, "Вареное", "Пшеничное", "Макароны", "Красивое" },
                    { 480, 5, 126.0, "Овощное", "Мягкое", "Шоколад", "Ароматное" },
                    { 505, 5, 184.0, "Свежевыжатое", "Полезное", "Сыр", "Твердое" },
                    { 529, 5, 124.0, "Сочное", "Жареное", "Сахар", "Пикантное" },
                    { 532, 5, 61.0, "Острое", "Свежее", "Красное вино", "Вареное" },
                    { 555, 5, 134.0, "Тушеное", "Овощное", "Огурцы", "Вареное" },
                    { 558, 5, 53.0, "Полезное", "Питательное", "Макароны", "Питательное" },
                    { 599, 5, 184.0, "Вареное", "Медовое", "Красное вино", "Жидкое" },
                    { 609, 5, 248.0, "Мясное", "Питательное", "Рыба", "Сырое" },
                    { 615, 5, 234.0, "Запеченное", "Свежее", "Орехи", "Шоколадное" },
                    { 630, 5, 96.0, "Ржаное", "Сытное", "Торт", "Ржаное" },
                    { 656, 5, 20.0, "Нежное", "Морское", "Томаты", "Острое" },
                    { 663, 5, 191.0, "Жареное", "Твердое", "Сгущенка", "Вареное" },
                    { 702, 5, 31.0, "Пшеничное", "Твердое", "Огурцы", "Сырое" },
                    { 706, 5, 173.0, "Твердое", "Морское", "Огурцы", "Рыбное" },
                    { 708, 5, 160.0, "Мягкое", "Твердое", "Белое вино", "Тушеное" },
                    { 709, 5, 120.0, "Свежевыжатое", "Пикантное", "Печенье", "Полезное" },
                    { 711, 5, 44.0, "Свежее", "Вареное", "Маргарин", "Жареное" },
                    { 747, 5, 11.0, "Соленое", "Пикантное", "Морепродукты", "Пряное" },
                    { 766, 5, 163.0, "Мягкое", "Сырое", "Яйца", "Ароматное" },
                    { 768, 5, 129.0, "Морское", "Пшеничное", "Морепродукты", "Мягкое" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 773, 5, 249.0, "Мягкое", "Жидкое", "Пицца", "Свежевыжатое" },
                    { 788, 5, 18.0, "Сладкое", "Сочное", "Соус", "Свежевыжатое" },
                    { 411, 5, 22.0, "Соленое", "Тушеное", "Пельмени", "Свежевыжатое" },
                    { 371, 5, 7.0, "Ржаное", "Морское", "Мясо", "Ванильное" },
                    { 361, 5, 17.0, "Соленое", "Овощное", "Паста", "Овощное" },
                    { 359, 5, 29.0, "Сочное", "Ржаное", "Салат", "Фруктовое" },
                    { 882, 4, 131.0, "Рыбное", "Жареное", "Кекс", "Сырое" },
                    { 884, 4, 31.0, "Ванильное", "Жидкое", "Гречка", "Мягкое" },
                    { 890, 4, 149.0, "Рыбное", "Сытное", "Яйца", "Свежевыжатое" },
                    { 897, 4, 223.0, "Молочное", "Ванильное", "Орехи", "Питательное" },
                    { 929, 4, 10.0, "Постное", "Сытное", "Кола", "Медовое" },
                    { 935, 4, 225.0, "Сладкое", "Ванильное", "Квас", "Медовое" },
                    { 942, 4, 102.0, "Пикантное", "Сытное", "Пицца", "Жидкое" },
                    { 957, 4, 27.0, "Ванильное", "Фруктовое", "Сыр", "Полезное" },
                    { 964, 4, 127.0, "Ванильное", "Полезное", "Майонез", "Пикантное" },
                    { 965, 4, 131.0, "Вкусное", "Питательное", "Квас", "Фруктовое" },
                    { 8, 5, 98.0, "Острое", "Вкусное", "Томаты", "Морское" },
                    { 22, 5, 248.0, "Пряное", "Сытное", "Гречка", "Молочное" },
                    { 41, 5, 194.0, "Полезное", "Питательное", "Сгущенка", "Молочное" },
                    { 703, 3, 143.0, "Полезное", "Сырое", "Маргарин", "Пряное" },
                    { 49, 5, 225.0, "Вкусное", "Пшеничное", "Соль", "Фруктовое" },
                    { 79, 5, 4.0, "Питательное", "Мягкое", "Рис", "Соленое" },
                    { 145, 5, 75.0, "Шоколадное", "Морское", "Мясо", "Мягкое" },
                    { 159, 5, 30.0, "Ржаное", "Овощное", "Пельмени", "Медовое" },
                    { 160, 5, 4.0, "Сырое", "Полезное", "Рис", "Тушеное" },
                    { 170, 5, 94.0, "Запеченное", "Соленое", "Тушенка", "Сытное" },
                    { 175, 5, 39.0, "Мягкое", "Овощное", "Печенье", "Сладкое" },
                    { 192, 5, 40.0, "Рыбное", "Медовое", "Картофель", "Рыбное" },
                    { 237, 5, 208.0, "Запеченное", "Ванильное", "Фрукты", "Мясное" },
                    { 240, 5, 5.0, "Молочное", "Соленое", "Мед", "Запеченное" },
                    { 245, 5, 80.0, "Ароматное", "Шоколадное", "Сахар", "Жареное" },
                    { 272, 5, 126.0, "Свежее", "Жидкое", "Рис", "Сладкое" },
                    { 333, 5, 192.0, "Шоколадное", "Свежевыжатое", "Мед", "Шоколадное" },
                    { 357, 5, 217.0, "Фруктовое", "Рыбное", "Кетчуп", "Жидкое" },
                    { 60, 5, 191.0, "Пикантное", "Ванильное", "Кофе", "Вкусное" },
                    { 795, 5, 52.0, "Питательное", "Питательное", "Орехи", "Жидкое" },
                    { 680, 3, 26.0, "Соленое", "Мясное", "Сгущенка", "Пикантное" },
                    { 677, 3, 36.0, "Сырое", "Свежевыжатое", "Кола", "Острое" },
                    { 900, 1, 94.0, "Сытное", "Красивое", "Рис", "Ароматное" },
                    { 904, 1, 63.0, "Морское", "Свежевыжатое", "Огурцы", "Свежевыжатое" },
                    { 906, 1, 39.0, "Пикантное", "Питательное", "Перец", "Ванильное" },
                    { 912, 1, 4.0, "Сладкое", "Питательное", "Мед", "Приправленное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 918, 1, 69.0, "Медовое", "Сочное", "Мороженное", "Мясное" },
                    { 975, 1, 117.0, "Пшеничное", "Пшеничное", "Хлеб", "Сладкое" },
                    { 991, 1, 72.0, "Питательное", "Овощное", "Сгущенка", "Твердое" },
                    { 1, 2, 231.0, "Медовое", "Питательное", "Печенье", "Нежное" },
                    { 7, 2, 215.0, "Постное", "Свежевыжатое", "Макароны", "Мягкое" },
                    { 47, 2, 49.0, "Питательное", "Сытное", "Пицца", "Запеченное" },
                    { 53, 2, 203.0, "Сочное", "Соленое", "Морепродукты", "Шоколадное" },
                    { 76, 2, 33.0, "Мягкое", "Соленое", "Пирог", "Сладкое" },
                    { 78, 2, 210.0, "Рыбное", "Жидкое", "Яйца", "Постное" },
                    { 81, 2, 155.0, "Сырое", "Мясное", "Соус", "Фруктовое" },
                    { 109, 2, 47.0, "Твердое", "Полезное", "Вода", "Рыбное" },
                    { 128, 2, 64.0, "Вкусное", "Овощное", "Пирог", "Мясное" },
                    { 143, 2, 3.0, "Сладкое", "Молочное", "Курица", "Сытное" },
                    { 152, 2, 54.0, "Сытное", "Запеченное", "Торт", "Питательное" },
                    { 173, 2, 13.0, "Медовое", "Натуральное", "Красное вино", "Полезное" },
                    { 176, 2, 237.0, "Пряное", "Ржаное", "Пицца", "Мягкое" },
                    { 186, 2, 18.0, "Вареное", "Сладкое", "Салат", "Натуральное" },
                    { 259, 2, 229.0, "Ванильное", "Ароматное", "Овощи", "Шоколадное" },
                    { 297, 2, 10.0, "Пикантное", "Шоколадное", "Кола", "Сладкое" },
                    { 306, 2, 220.0, "Овощное", "Сладкое", "Шоколад", "Морское" },
                    { 310, 2, 157.0, "Сочное", "Шоколадное", "Тушенка", "Натуральное" },
                    { 314, 2, 65.0, "Овощное", "Свежевыжатое", "Кекс", "Рыбное" },
                    { 331, 2, 1.0, "Сладкое", "Сладкое", "Пицца", "Ржаное" },
                    { 888, 1, 110.0, "Свежее", "Вареное", "Орехи", "Питательное" },
                    { 345, 2, 149.0, "Овощное", "Сладкое", "Кекс", "Сочное" },
                    { 857, 1, 171.0, "Пшеничное", "Рыбное", "Соус", "Сочное" },
                    { 785, 1, 77.0, "Сладкое", "Жидкое", "Сок", "Нежное" },
                    { 66, 1, 42.0, "Молочное", "Красивое", "Картофель", "Питательное" },
                    { 73, 1, 115.0, "Натуральное", "Сочное", "Пельмени", "Вкусное" },
                    { 77, 1, 246.0, "Красивое", "Рыбное", "Мороженное", "Питательное" },
                    { 90, 1, 152.0, "Рыбное", "Вареное", "Кетчуп", "Твердое" },
                    { 147, 1, 115.0, "Пряное", "Рыбное", "Гречка", "Жареное" },
                    { 222, 1, 60.0, "Рыбное", "Приправленное", "Молоко", "Вкусное" },
                    { 243, 1, 80.0, "Запеченное", "Пикантное", "Овощи", "Жидкое" },
                    { 289, 1, 67.0, "Овощное", "Запеченное", "Перец", "Запеченное" },
                    { 319, 1, 67.0, "Морское", "Пшеничное", "Пицца", "Жареное" },
                    { 349, 1, 83.0, "Сочное", "Ржаное", "Рыба", "Фруктовое" },
                    { 374, 1, 122.0, "Запеченное", "Сытное", "Картофель", "Овощное" },
                    { 389, 1, 23.0, "Приправленное", "Свежее", "Салат", "Сочное" },
                    { 408, 1, 206.0, "Молочное", "Твердое", "Торт", "Жидкое" },
                    { 453, 1, 218.0, "Пикантное", "Сырое", "Красное вино", "Пикантное" },
                    { 464, 1, 91.0, "Свежевыжатое", "Медовое", "Овощи", "Ржаное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 478, 1, 211.0, "Пряное", "Молочное", "Шоколад", "Сладкое" },
                    { 487, 1, 197.0, "Ароматное", "Твердое", "Майонез", "Нежное" },
                    { 495, 1, 243.0, "Овощное", "Жидкое", "Огурцы", "Молочное" },
                    { 559, 1, 249.0, "Вареное", "Красивое", "Белое вино", "Ароматное" },
                    { 581, 1, 19.0, "Вареное", "Фруктовое", "Белое вино", "Вареное" },
                    { 596, 1, 140.0, "Мягкое", "Мясное", "Гречка", "Питательное" },
                    { 616, 1, 206.0, "Морское", "Питательное", "Сахар", "Ароматное" },
                    { 629, 1, 94.0, "Сырое", "Рыбное", "Мороженное", "Вареное" },
                    { 647, 1, 93.0, "Вкусное", "Запеченное", "Чай", "Пряное" },
                    { 648, 1, 223.0, "Острое", "Шоколадное", "Тушенка", "Ржаное" },
                    { 668, 1, 190.0, "Фруктовое", "Сырое", "Пицца", "Запеченное" },
                    { 686, 1, 248.0, "Сырое", "Жареное", "Кола", "Твердое" },
                    { 850, 1, 54.0, "Тушеное", "Постное", "Молоко", "Соленое" },
                    { 369, 2, 71.0, "Мясное", "Сытное", "Томаты", "Натуральное" },
                    { 382, 2, 36.0, "Свежевыжатое", "Сладкое", "Рис", "Запеченное" },
                    { 423, 2, 146.0, "Острое", "Натуральное", "Овощи", "Острое" },
                    { 98, 3, 103.0, "Вкусное", "Острое", "Морепродукты", "Полезное" },
                    { 100, 3, 55.0, "Пряное", "Медовое", "Пицца", "Шоколадное" },
                    { 122, 3, 78.0, "Свежевыжатое", "Рыбное", "Макароны", "Пикантное" },
                    { 144, 3, 46.0, "Вареное", "Мясное", "Пицца", "Запеченное" },
                    { 161, 3, 233.0, "Мягкое", "Жареное", "Мясо", "Запеченное" },
                    { 167, 3, 88.0, "Сырое", "Сочное", "Сахар", "Сочное" },
                    { 177, 3, 212.0, "Постное", "Приправленное", "Молоко", "Мягкое" },
                    { 205, 3, 11.0, "Мягкое", "Красивое", "Вода", "Мясное" },
                    { 256, 3, 217.0, "Полезное", "Мясное", "Яйца", "Нежное" },
                    { 280, 3, 10.0, "Вкусное", "Молочное", "Сахар", "Твердое" },
                    { 284, 3, 20.0, "Свежевыжатое", "Сладкое", "Макароны", "Нежное" },
                    { 303, 3, 61.0, "Ванильное", "Соленое", "Мороженное", "Овощное" },
                    { 311, 3, 15.0, "Сырое", "Пикантное", "Морковь", "Тушеное" },
                    { 363, 3, 88.0, "Запеченное", "Мясное", "Чай", "Сырое" },
                    { 378, 3, 89.0, "Морское", "Шоколадное", "Сахар", "Сочное" },
                    { 395, 3, 61.0, "Пшеничное", "Ржаное", "Рыба", "Твердое" },
                    { 406, 3, 24.0, "Пшеничное", "Рыбное", "Пирог", "Сладкое" },
                    { 417, 3, 187.0, "Сырое", "Ванильное", "Мороженное", "Мясное" },
                    { 442, 3, 127.0, "Сытное", "Сладкое", "Торт", "Сырое" },
                    { 443, 3, 127.0, "Сочное", "Жареное", "Кетчуп", "Красивое" },
                    { 444, 3, 206.0, "Сытное", "Питательное", "Печенье", "Мясное" },
                    { 454, 3, 248.0, "Пикантное", "Морское", "Кекс", "Медовое" },
                    { 518, 3, 76.0, "Вареное", "Молочное", "Кетчуп", "Сладкое" },
                    { 519, 3, 164.0, "Тушеное", "Сладкое", "Курица", "Мясное" },
                    { 553, 3, 98.0, "Красивое", "Натуральное", "Курица", "Сытное" },
                    { 580, 3, 247.0, "Соленое", "Жидкое", "Гречка", "Постное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 670, 3, 19.0, "Морское", "Красивое", "Соус", "Сырое" },
                    { 82, 3, 242.0, "Вкусное", "Сытное", "Рыба", "Свежее" },
                    { 52, 3, 155.0, "Сытное", "Запеченное", "Пельмени", "Морское" },
                    { 38, 3, 231.0, "Морское", "Натуральное", "Салат", "Жареное" },
                    { 25, 3, 60.0, "Питательное", "Медовое", "Морепродукты", "Вареное" },
                    { 429, 2, 207.0, "Сырое", "Медовое", "Овощи", "Тушеное" },
                    { 430, 2, 11.0, "Питательное", "Пшеничное", "Тушенка", "Сочное" },
                    { 457, 2, 139.0, "Пшеничное", "Морское", "Сок", "Полезное" },
                    { 476, 2, 30.0, "Твердое", "Натуральное", "Сгущенка", "Ароматное" },
                    { 488, 2, 126.0, "Соленое", "Молочное", "Вода", "Жидкое" },
                    { 538, 2, 232.0, "Питательное", "Мягкое", "Морепродукты", "Пшеничное" },
                    { 542, 2, 77.0, "Медовое", "Свежевыжатое", "Мороженное", "Молочное" },
                    { 625, 2, 145.0, "Красивое", "Мягкое", "Макароны", "Постное" },
                    { 651, 2, 49.0, "Ароматное", "Мягкое", "Мед", "Овощное" },
                    { 653, 2, 45.0, "Ржаное", "Сочное", "Кекс", "Постное" },
                    { 673, 2, 151.0, "Соленое", "Соленое", "Яйца", "Пшеничное" },
                    { 679, 2, 235.0, "Медовое", "Вкусное", "Орехи", "Сладкое" },
                    { 730, 2, 151.0, "Свежевыжатое", "Медовое", "Тушенка", "Рыбное" },
                    { 678, 3, 112.0, "Сырое", "Пряное", "Хлеб", "Вареное" },
                    { 732, 2, 245.0, "Натуральное", "Фруктовое", "Соус", "Свежевыжатое" },
                    { 744, 2, 160.0, "Жареное", "Питательное", "Торт", "Натуральное" },
                    { 778, 2, 122.0, "Нежное", "Вареное", "Кофе", "Шоколадное" },
                    { 797, 2, 239.0, "Сырое", "Приправленное", "Перец", "Морское" },
                    { 833, 2, 175.0, "Ржаное", "Пикантное", "Соль", "Ржаное" },
                    { 867, 2, 76.0, "Пикантное", "Рыбное", "Чай", "Сладкое" },
                    { 878, 2, 132.0, "Ванильное", "Пикантное", "Хлеб", "Сырое" },
                    { 916, 2, 73.0, "Морское", "Острое", "Овощи", "Жареное" },
                    { 951, 2, 125.0, "Шоколадное", "Рыбное", "Сыр", "Полезное" },
                    { 958, 2, 44.0, "Морское", "Красивое", "Мясо", "Тушеное" },
                    { 961, 2, 126.0, "Тушеное", "Приправленное", "Гречка", "Овощное" },
                    { 983, 2, 161.0, "Овощное", "Вареное", "Торт", "Рыбное" },
                    { 3, 3, 76.0, "Постное", "Мясное", "Торт", "Мясное" },
                    { 17, 3, 174.0, "Сладкое", "Шоколадное", "Кетчуп", "Овощное" },
                    { 741, 2, 126.0, "Фруктовое", "Вкусное", "Курица", "Жидкое" },
                    { 908, 5, 32.0, "Рыбное", "Сырое", "Курица", "Питательное" },
                    { 927, 5, 213.0, "Ароматное", "Фруктовое", "Кофе", "Запеченное" },
                    { 931, 5, 23.0, "Пшеничное", "Медовое", "Хлеб", "Сладкое" },
                    { 601, 8, 146.0, "Пряное", "Молочное", "Сгущенка", "Острое" },
                    { 602, 8, 213.0, "Мясное", "Сладкое", "Каша", "Сладкое" },
                    { 654, 8, 17.0, "Сладкое", "Медовое", "Курица", "Мясное" },
                    { 689, 8, 60.0, "Вкусное", "Твердое", "Пельмени", "Пикантное" },
                    { 756, 8, 122.0, "Шоколадное", "Сырое", "Гречка", "Рыбное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 787, 8, 208.0, "Мясное", "Сытное", "Паста", "Соленое" },
                    { 791, 8, 144.0, "Нежное", "Запеченное", "Салат", "Сочное" },
                    { 792, 8, 131.0, "Свежее", "Ароматное", "Сгущенка", "Морское" },
                    { 800, 8, 185.0, "Ароматное", "Жидкое", "Рис", "Красивое" },
                    { 831, 8, 64.0, "Острое", "Молочное", "Овощи", "Сытное" },
                    { 860, 8, 117.0, "Пряное", "Мясное", "Тушенка", "Пикантное" },
                    { 872, 8, 196.0, "Овощное", "Сырое", "Кетчуп", "Тушеное" },
                    { 894, 8, 192.0, "Красивое", "Мясное", "Рыба", "Вареное" },
                    { 905, 8, 122.0, "Мягкое", "Тушеное", "Вода", "Пикантное" },
                    { 907, 8, 201.0, "Соленое", "Мясное", "Фрукты", "Полезное" },
                    { 963, 8, 249.0, "Сытное", "Ржаное", "Кетчуп", "Сладкое" },
                    { 970, 8, 132.0, "Пшеничное", "Острое", "Кетчуп", "Полезное" },
                    { 11, 9, 194.0, "Сочное", "Ароматное", "Паста", "Ржаное" },
                    { 24, 9, 40.0, "Пикантное", "Медовое", "Морковь", "Полезное" },
                    { 108, 9, 124.0, "Твердое", "Запеченное", "Майонез", "Сочное" },
                    { 116, 9, 31.0, "Сладкое", "Нежное", "Пицца", "Нежное" },
                    { 120, 9, 21.0, "Мясное", "Приправленное", "Сок", "Натуральное" },
                    { 125, 9, 236.0, "Овощное", "Тушеное", "Кетчуп", "Жареное" },
                    { 166, 9, 5.0, "Вареное", "Жидкое", "Овощи", "Питательное" },
                    { 187, 9, 188.0, "Пряное", "Сладкое", "Кофе", "Жидкое" },
                    { 198, 9, 88.0, "Постное", "Красивое", "Орехи", "Вареное" },
                    { 244, 9, 224.0, "Натуральное", "Твердое", "Курица", "Рыбное" },
                    { 598, 8, 140.0, "Приправленное", "Шоколадное", "Яйца", "Постное" },
                    { 260, 9, 102.0, "Молочное", "Нежное", "Макароны", "Морское" },
                    { 592, 8, 71.0, "Вкусное", "Вкусное", "Соль", "Пикантное" },
                    { 578, 8, 226.0, "Жидкое", "Пряное", "Печенье", "Жареное" },
                    { 221, 8, 70.0, "Тушеное", "Пшеничное", "Рыба", "Тушеное" },
                    { 226, 8, 59.0, "Овощное", "Соленое", "Кекс", "Пшеничное" },
                    { 234, 8, 62.0, "Ароматное", "Вкусное", "Сок", "Фруктовое" },
                    { 264, 8, 92.0, "Овощное", "Мясное", "Томаты", "Ароматное" },
                    { 268, 8, 76.0, "Натуральное", "Шоколадное", "Маргарин", "Острое" },
                    { 270, 8, 1.0, "Ароматное", "Мягкое", "Сахар", "Пряное" },
                    { 287, 8, 202.0, "Постное", "Нежное", "Макароны", "Сочное" },
                    { 326, 8, 73.0, "Натуральное", "Полезное", "Мясо", "Свежевыжатое" },
                    { 336, 8, 147.0, "Нежное", "Морское", "Сок", "Жидкое" },
                    { 347, 8, 149.0, "Питательное", "Фруктовое", "Кекс", "Соленое" },
                    { 348, 8, 131.0, "Пшеничное", "Соленое", "Фрукты", "Пикантное" },
                    { 351, 8, 189.0, "Твердое", "Ржаное", "Кекс", "Твердое" },
                    { 373, 8, 33.0, "Питательное", "Острое", "Салат", "Красивое" },
                    { 375, 8, 202.0, "Молочное", "Вареное", "Пицца", "Пикантное" },
                    { 377, 8, 219.0, "Вкусное", "Вкусное", "Чай", "Овощное" },
                    { 393, 8, 101.0, "Фруктовое", "Овощное", "Молоко", "Жидкое" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 394, 8, 2.0, "Натуральное", "Мясное", "Мед", "Сочное" },
                    { 431, 8, 93.0, "Сочное", "Морское", "Каша", "Свежее" },
                    { 440, 8, 63.0, "Молочное", "Свежевыжатое", "Морковь", "Красивое" },
                    { 452, 8, 144.0, "Морское", "Ржаное", "Мед", "Вкусное" },
                    { 499, 8, 67.0, "Ароматное", "Жареное", "Перец", "Красивое" },
                    { 506, 8, 181.0, "Соленое", "Нежное", "Белое вино", "Жареное" },
                    { 524, 8, 210.0, "Вкусное", "Соленое", "Орехи", "Полезное" },
                    { 547, 8, 83.0, "Приправленное", "Сладкое", "Соль", "Медовое" },
                    { 556, 8, 168.0, "Шоколадное", "Пикантное", "Молоко", "Вареное" },
                    { 565, 8, 177.0, "Сочное", "Шоколадное", "Кетчуп", "Пикантное" },
                    { 569, 8, 133.0, "Постное", "Соленое", "Майонез", "Постное" },
                    { 588, 8, 246.0, "Ванильное", "Запеченное", "Чай", "Сладкое" },
                    { 276, 9, 144.0, "Красивое", "Медовое", "Перец", "Постное" },
                    { 307, 9, 169.0, "Ржаное", "Шоколадное", "Сахар", "Соленое" },
                    { 308, 9, 71.0, "Морское", "Ржаное", "Белое вино", "Ржаное" },
                    { 794, 9, 123.0, "Пшеничное", "Сытное", "Овощи", "Овощное" },
                    { 805, 9, 231.0, "Овощное", "Пшеничное", "Фрукты", "Рыбное" },
                    { 821, 9, 237.0, "Рыбное", "Пшеничное", "Овощи", "Пшеничное" },
                    { 848, 9, 50.0, "Мягкое", "Постное", "Томаты", "Ржаное" },
                    { 853, 9, 74.0, "Питательное", "Красивое", "Хлеб", "Вкусное" },
                    { 854, 9, 79.0, "Нежное", "Свежевыжатое", "Кофе", "Тушеное" },
                    { 865, 9, 14.0, "Жареное", "Сытное", "Кофе", "Натуральное" },
                    { 871, 9, 129.0, "Пряное", "Вкусное", "Тушенка", "Пикантное" },
                    { 877, 9, 146.0, "Сладкое", "Пряное", "Сгущенка", "Медовое" },
                    { 936, 9, 142.0, "Пшеничное", "Ароматное", "Мороженное", "Свежее" },
                    { 981, 9, 239.0, "Постное", "Вкусное", "Овощи", "Пшеничное" },
                    { 990, 9, 213.0, "Сырое", "Морское", "Сгущенка", "Сочное" },
                    { 19, 10, 86.0, "Натуральное", "Сладкое", "Тушенка", "Красивое" },
                    { 42, 10, 64.0, "Твердое", "Сладкое", "Красное вино", "Ароматное" },
                    { 50, 10, 66.0, "Свежее", "Нежное", "Мед", "Сладкое" },
                    { 59, 10, 80.0, "Постное", "Сладкое", "Сгущенка", "Острое" },
                    { 61, 10, 37.0, "Острое", "Молочное", "Шоколад", "Сладкое" },
                    { 94, 10, 234.0, "Острое", "Тушеное", "Макароны", "Острое" },
                    { 106, 10, 6.0, "Пикантное", "Ванильное", "Соус", "Запеченное" },
                    { 113, 10, 131.0, "Тушеное", "Вареное", "Мясо", "Соленое" },
                    { 149, 10, 5.0, "Ванильное", "Сладкое", "Хлеб", "Сладкое" },
                    { 208, 10, 135.0, "Острое", "Твердое", "Тушенка", "Приправленное" },
                    { 223, 10, 88.0, "Вареное", "Жареное", "Морепродукты", "Постное" },
                    { 285, 10, 119.0, "Постное", "Острое", "Морковь", "Сытное" },
                    { 305, 10, 140.0, "Пикантное", "Ароматное", "Сгущенка", "Приправленное" },
                    { 386, 10, 21.0, "Медовое", "Мягкое", "Паста", "Фруктовое" },
                    { 398, 10, 226.0, "Нежное", "Сочное", "Кофе", "Сочное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 790, 9, 47.0, "Сырое", "Сочное", "Вода", "Запеченное" },
                    { 781, 9, 104.0, "Свежее", "Нежное", "Гречка", "Фруктовое" },
                    { 716, 9, 175.0, "Ванильное", "Сочное", "Маргарин", "Приправленное" },
                    { 641, 9, 235.0, "Сладкое", "Ванильное", "Соус", "Свежее" },
                    { 309, 9, 123.0, "Ванильное", "Приправленное", "Курица", "Вареное" },
                    { 350, 9, 188.0, "Пряное", "Постное", "Яйца", "Вареное" },
                    { 354, 9, 167.0, "Шоколадное", "Вкусное", "Морковь", "Медовое" },
                    { 360, 9, 55.0, "Острое", "Полезное", "Овощи", "Сладкое" },
                    { 376, 9, 49.0, "Рыбное", "Соленое", "Соус", "Жареное" },
                    { 380, 9, 47.0, "Вареное", "Пряное", "Соль", "Рыбное" },
                    { 381, 9, 14.0, "Нежное", "Полезное", "Паста", "Натуральное" },
                    { 385, 9, 202.0, "Овощное", "Нежное", "Гречка", "Морское" },
                    { 390, 9, 86.0, "Пряное", "Мягкое", "Мясо", "Ржаное" },
                    { 401, 9, 168.0, "Постное", "Молочное", "Хлеб", "Мягкое" },
                    { 410, 9, 68.0, "Красивое", "Пряное", "Яйца", "Сырое" },
                    { 419, 9, 231.0, "Морское", "Полезное", "Чай", "Вкусное" },
                    { 420, 9, 78.0, "Ароматное", "Сырое", "Сгущенка", "Сытное" },
                    { 174, 8, 205.0, "Мясное", "Ванильное", "Морепродукты", "Свежее" },
                    { 462, 9, 218.0, "Жареное", "Красивое", "Фрукты", "Сытное" },
                    { 470, 9, 122.0, "Сладкое", "Овощное", "Печенье", "Мясное" },
                    { 513, 9, 135.0, "Жидкое", "Пикантное", "Салат", "Запеченное" },
                    { 525, 9, 203.0, "Вареное", "Вкусное", "Пирог", "Красивое" },
                    { 527, 9, 201.0, "Полезное", "Пшеничное", "Перец", "Сладкое" },
                    { 528, 9, 215.0, "Постное", "Сытное", "Перец", "Жидкое" },
                    { 533, 9, 66.0, "Пшеничное", "Острое", "Мясо", "Тушеное" },
                    { 545, 9, 14.0, "Ванильное", "Фруктовое", "Кетчуп", "Сладкое" },
                    { 546, 9, 241.0, "Сочное", "Острое", "Мороженное", "Полезное" },
                    { 550, 9, 28.0, "Жареное", "Острое", "Томаты", "Пшеничное" },
                    { 589, 9, 233.0, "Тушеное", "Запеченное", "Перец", "Красивое" },
                    { 605, 9, 245.0, "Твердое", "Питательное", "Сыр", "Постное" },
                    { 621, 9, 142.0, "Питательное", "Сладкое", "Каша", "Сладкое" },
                    { 638, 9, 76.0, "Вареное", "Ржаное", "Мороженное", "Сладкое" },
                    { 463, 9, 193.0, "Овощное", "Вареное", "Орехи", "Фруктовое" },
                    { 171, 8, 56.0, "Острое", "Сытное", "Чай", "Сочное" },
                    { 158, 8, 127.0, "Вкусное", "Острое", "Морковь", "Мягкое" },
                    { 146, 8, 49.0, "Свежевыжатое", "Пшеничное", "Печенье", "Соленое" },
                    { 503, 6, 240.0, "Медовое", "Натуральное", "Кола", "Приправленное" },
                    { 543, 6, 24.0, "Постное", "Рыбное", "Мясо", "Острое" },
                    { 544, 6, 155.0, "Приправленное", "Нежное", "Пирог", "Шоколадное" },
                    { 568, 6, 245.0, "Сытное", "Вареное", "Огурцы", "Медовое" },
                    { 573, 6, 184.0, "Сочное", "Тушеное", "Морепродукты", "Тушеное" },
                    { 582, 6, 156.0, "Вкусное", "Острое", "Кофе", "Полезное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 655, 6, 162.0, "Молочное", "Медовое", "Мясо", "Ароматное" },
                    { 667, 6, 108.0, "Свежее", "Мягкое", "Орехи", "Сытное" },
                    { 693, 6, 26.0, "Мягкое", "Тушеное", "Сгущенка", "Питательное" },
                    { 701, 6, 187.0, "Твердое", "Молочное", "Майонез", "Вареное" },
                    { 710, 6, 215.0, "Тушеное", "Пикантное", "Курица", "Сырое" },
                    { 717, 6, 38.0, "Сырое", "Жареное", "Мороженное", "Овощное" },
                    { 763, 6, 230.0, "Тушеное", "Питательное", "Печенье", "Сочное" },
                    { 764, 6, 227.0, "Свежее", "Ароматное", "Красное вино", "Ванильное" },
                    { 780, 6, 179.0, "Жареное", "Острое", "Соль", "Ароматное" },
                    { 789, 6, 19.0, "Жидкое", "Морское", "Каша", "Постное" },
                    { 798, 6, 103.0, "Полезное", "Красивое", "Шоколад", "Острое" },
                    { 803, 6, 114.0, "Запеченное", "Ржаное", "Макароны", "Жидкое" },
                    { 810, 6, 112.0, "Пшеничное", "Натуральное", "Картофель", "Полезное" },
                    { 824, 6, 185.0, "Приправленное", "Тушеное", "Мороженное", "Вареное" },
                    { 827, 6, 23.0, "Запеченное", "Вареное", "Макароны", "Морское" },
                    { 843, 6, 14.0, "Сырое", "Сырое", "Томаты", "Натуральное" },
                    { 899, 6, 133.0, "Приправленное", "Сочное", "Шоколад", "Запеченное" },
                    { 903, 6, 63.0, "Красивое", "Пшеничное", "Перец", "Ржаное" },
                    { 911, 6, 207.0, "Вареное", "Рыбное", "Сахар", "Ароматное" },
                    { 939, 6, 120.0, "Мясное", "Пряное", "Перец", "Пикантное" },
                    { 976, 6, 77.0, "Рыбное", "Соленое", "Курица", "Тушеное" },
                    { 497, 6, 89.0, "Сладкое", "Рыбное", "Кофе", "Вареное" },
                    { 486, 6, 151.0, "Шоколадное", "Соленое", "Кофе", "Питательное" },
                    { 483, 6, 167.0, "Овощное", "Приправленное", "Яйца", "Ароматное" },
                    { 458, 6, 82.0, "Молочное", "Вареное", "Печенье", "Овощное" },
                    { 941, 5, 203.0, "Мясное", "Сладкое", "Пирог", "Молочное" },
                    { 944, 5, 154.0, "Медовое", "Сладкое", "Фрукты", "Сытное" },
                    { 954, 5, 22.0, "Молочное", "Питательное", "Квас", "Нежное" },
                    { 972, 5, 33.0, "Молочное", "Ржаное", "Мясо", "Вкусное" },
                    { 987, 5, 170.0, "Сочное", "Острое", "Сахар", "Пикантное" },
                    { 997, 5, 184.0, "Медовое", "Вкусное", "Салат", "Мягкое" },
                    { 1000, 5, 103.0, "Питательное", "Сырое", "Соль", "Мягкое" },
                    { 9, 6, 214.0, "Постное", "Острое", "Маргарин", "Натуральное" },
                    { 30, 6, 231.0, "Молочное", "Морское", "Сахар", "Красивое" },
                    { 48, 6, 219.0, "Сырое", "Вкусное", "Молоко", "Молочное" },
                    { 71, 6, 84.0, "Сытное", "Сытное", "Кекс", "Вкусное" },
                    { 151, 6, 14.0, "Твердое", "Овощное", "Мороженное", "Красивое" },
                    { 184, 6, 157.0, "Молочное", "Сырое", "Соус", "Сладкое" },
                    { 979, 6, 47.0, "Медовое", "Шоколадное", "Пицца", "Рыбное" },
                    { 203, 6, 67.0, "Вареное", "Питательное", "Морковь", "Сырое" },
                    { 215, 6, 44.0, "Натуральное", "Вареное", "Сахар", "Шоколадное" },
                    { 254, 6, 2.0, "Запеченное", "Нежное", "Фрукты", "Сытное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 265, 6, 185.0, "Твердое", "Острое", "Перец", "Медовое" },
                    { 277, 6, 178.0, "Ржаное", "Ванильное", "Курица", "Запеченное" },
                    { 291, 6, 245.0, "Жидкое", "Нежное", "Майонез", "Натуральное" },
                    { 323, 6, 186.0, "Ванильное", "Сытное", "Кофе", "Питательное" },
                    { 334, 6, 162.0, "Мягкое", "Пшеничное", "Фрукты", "Тушеное" },
                    { 337, 6, 187.0, "Полезное", "Сладкое", "Соль", "Шоколадное" },
                    { 338, 6, 106.0, "Морское", "Пряное", "Перец", "Фруктовое" },
                    { 399, 6, 147.0, "Медовое", "Молочное", "Овощи", "Ванильное" },
                    { 422, 6, 143.0, "Жидкое", "Пикантное", "Перец", "Вкусное" },
                    { 427, 6, 194.0, "Пряное", "Сочное", "Мороженное", "Сладкое" },
                    { 439, 6, 73.0, "Твердое", "Медовое", "Морковь", "Вареное" },
                    { 204, 6, 11.0, "Ароматное", "Молочное", "Орехи", "Вареное" },
                    { 968, 18, 121.0, "Сытное", "Соленое", "Яйца", "Жидкое" },
                    { 993, 6, 64.0, "Мясное", "Сырое", "Пирог", "Приправленное" },
                    { 32, 7, 76.0, "Приправленное", "Мягкое", "Соус", "Свежевыжатое" },
                    { 738, 7, 150.0, "Запеченное", "Натуральное", "Квас", "Медовое" },
                    { 759, 7, 2.0, "Сладкое", "Рыбное", "Соус", "Острое" },
                    { 761, 7, 65.0, "Рыбное", "Молочное", "Морковь", "Сладкое" },
                    { 772, 7, 171.0, "Рыбное", "Ароматное", "Кетчуп", "Сытное" },
                    { 779, 7, 93.0, "Запеченное", "Питательное", "Сгущенка", "Медовое" },
                    { 863, 7, 175.0, "Вкусное", "Рыбное", "Каша", "Сладкое" },
                    { 876, 7, 234.0, "Пшеничное", "Морское", "Белое вино", "Вкусное" },
                    { 881, 7, 62.0, "Свежее", "Полезное", "Паста", "Натуральное" },
                    { 883, 7, 181.0, "Овощное", "Натуральное", "Тушенка", "Сладкое" },
                    { 895, 7, 110.0, "Молочное", "Фруктовое", "Морепродукты", "Приправленное" },
                    { 914, 7, 93.0, "Сочное", "Тушеное", "Вода", "Молочное" },
                    { 921, 7, 238.0, "Пшеничное", "Тушеное", "Паста", "Свежее" },
                    { 932, 7, 160.0, "Ароматное", "Вареное", "Шоколад", "Сытное" },
                    { 966, 7, 114.0, "Мягкое", "Шоколадное", "Сок", "Ржаное" },
                    { 2, 8, 23.0, "Постное", "Острое", "Курица", "Соленое" },
                    { 4, 8, 56.0, "Питательное", "Натуральное", "Шоколад", "Ароматное" },
                    { 37, 8, 5.0, "Пряное", "Овощное", "Пицца", "Жидкое" },
                    { 39, 8, 223.0, "Красивое", "Вкусное", "Соль", "Сладкое" },
                    { 40, 8, 165.0, "Жареное", "Пряное", "Майонез", "Запеченное" },
                    { 74, 8, 69.0, "Питательное", "Жареное", "Паста", "Свежее" },
                    { 91, 8, 145.0, "Ванильное", "Натуральное", "Хлеб", "Медовое" },
                    { 96, 8, 146.0, "Фруктовое", "Питательное", "Рыба", "Свежевыжатое" },
                    { 102, 8, 57.0, "Мясное", "Сладкое", "Кекс", "Морское" },
                    { 118, 8, 83.0, "Рыбное", "Острое", "Картофель", "Острое" },
                    { 121, 8, 75.0, "Фруктовое", "Сладкое", "Соль", "Натуральное" },
                    { 131, 8, 54.0, "Мягкое", "Натуральное", "Томаты", "Питательное" },
                    { 137, 8, 197.0, "Рыбное", "Твердое", "Сыр", "Полезное" }
                });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "Cost", "Description", "GeneralNote", "Name", "SpecialNote" },
                values: new object[,]
                {
                    { 698, 7, 59.0, "Ржаное", "Свежее", "Картофель", "Ароматное" },
                    { 688, 7, 20.0, "Жидкое", "Полезное", "Квас", "Острое" },
                    { 683, 7, 89.0, "Овощное", "Жидкое", "Курица", "Сладкое" },
                    { 666, 7, 217.0, "Морское", "Питательное", "Пельмени", "Приправленное" },
                    { 35, 7, 63.0, "Шоколадное", "Полезное", "Мороженное", "Тушеное" },
                    { 43, 7, 70.0, "Фруктовое", "Медовое", "Мороженное", "Сытное" },
                    { 54, 7, 142.0, "Вареное", "Постное", "Соль", "Жидкое" },
                    { 63, 7, 66.0, "Фруктовое", "Ванильное", "Салат", "Приправленное" },
                    { 65, 7, 48.0, "Пикантное", "Запеченное", "Морковь", "Постное" },
                    { 85, 7, 10.0, "Овощное", "Мягкое", "Кетчуп", "Свежевыжатое" },
                    { 97, 7, 37.0, "Морское", "Пряное", "Кекс", "Сырое" },
                    { 99, 7, 70.0, "Свежевыжатое", "Молочное", "Паста", "Питательное" },
                    { 127, 7, 166.0, "Жареное", "Постное", "Рыба", "Твердое" },
                    { 132, 7, 184.0, "Жидкое", "Ржаное", "Мед", "Питательное" },
                    { 148, 7, 115.0, "Шоколадное", "Рыбное", "Шоколад", "Полезное" },
                    { 180, 7, 98.0, "Питательное", "Ржаное", "Торт", "Шоколадное" },
                    { 200, 7, 237.0, "Молочное", "Сочное", "Пельмени", "Жидкое" },
                    { 20, 7, 217.0, "Сладкое", "Ароматное", "Маргарин", "Сладкое" },
                    { 236, 7, 195.0, "Жидкое", "Рыбное", "Сыр", "Питательное" },
                    { 299, 7, 227.0, "Полезное", "Питательное", "Сахар", "Приправленное" },
                    { 368, 7, 100.0, "Ароматное", "Твердое", "Паста", "Шоколадное" },
                    { 387, 7, 143.0, "Жидкое", "Мясное", "Молоко", "Свежевыжатое" },
                    { 434, 7, 30.0, "Тушеное", "Шоколадное", "Каша", "Пикантное" },
                    { 449, 7, 144.0, "Красивое", "Свежее", "Морковь", "Жидкое" },
                    { 509, 7, 235.0, "Твердое", "Натуральное", "Орехи", "Свежевыжатое" },
                    { 522, 7, 210.0, "Жидкое", "Сладкое", "Сок", "Тушеное" },
                    { 541, 7, 235.0, "Твердое", "Вареное", "Кофе", "Ароматное" },
                    { 574, 7, 83.0, "Ванильное", "Питательное", "Кола", "Полезное" },
                    { 606, 7, 221.0, "Свежее", "Тушеное", "Макароны", "Натуральное" },
                    { 614, 7, 221.0, "Полезное", "Соленое", "Майонез", "Медовое" },
                    { 626, 7, 45.0, "Натуральное", "Мягкое", "Рыба", "Молочное" },
                    { 661, 7, 239.0, "Свежевыжатое", "Ржаное", "Рис", "Жидкое" },
                    { 273, 7, 24.0, "Питательное", "Пшеничное", "Кофе", "Вареное" },
                    { 984, 18, 171.0, "Ванильное", "Рыбное", "Соль", "Мясное" }
                });

            migrationBuilder.CreateIndex(
                name: "IX_AspNetRoleClaims_RoleId",
                table: "AspNetRoleClaims",
                column: "RoleId");

            migrationBuilder.CreateIndex(
                name: "RoleNameIndex",
                table: "AspNetRoles",
                column: "NormalizedName",
                unique: true,
                filter: "[NormalizedName] IS NOT NULL");

            migrationBuilder.CreateIndex(
                name: "IX_AspNetUserClaims_UserId",
                table: "AspNetUserClaims",
                column: "UserId");

            migrationBuilder.CreateIndex(
                name: "IX_AspNetUserLogins_UserId",
                table: "AspNetUserLogins",
                column: "UserId");

            migrationBuilder.CreateIndex(
                name: "IX_AspNetUserRoles_RoleId",
                table: "AspNetUserRoles",
                column: "RoleId");

            migrationBuilder.CreateIndex(
                name: "EmailIndex",
                table: "AspNetUsers",
                column: "NormalizedEmail");

            migrationBuilder.CreateIndex(
                name: "UserNameIndex",
                table: "AspNetUsers",
                column: "NormalizedUserName",
                unique: true,
                filter: "[NormalizedUserName] IS NOT NULL");

            migrationBuilder.CreateIndex(
                name: "IX_Products_CategoryId",
                table: "Products",
                column: "CategoryId");
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropTable(
                name: "AspNetRoleClaims");

            migrationBuilder.DropTable(
                name: "AspNetUserClaims");

            migrationBuilder.DropTable(
                name: "AspNetUserLogins");

            migrationBuilder.DropTable(
                name: "AspNetUserRoles");

            migrationBuilder.DropTable(
                name: "AspNetUserTokens");

            migrationBuilder.DropTable(
                name: "Products");

            migrationBuilder.DropTable(
                name: "AspNetRoles");

            migrationBuilder.DropTable(
                name: "AspNetUsers");

            migrationBuilder.DropTable(
                name: "Categories");
        }
    }
}
